
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //9428 ASTRA ГайнаДИ AddOn Begin
	               
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ТекОбъект.ОписаниеПечатныхФорм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПечатныхФорм.Загрузить(ТекОбъект.ОписаниеПечатныхФорм);
	СписокНазначений.ЗагрузитьЗначения(ТекОбъект.МассивНазначений);
	
	Для каждого ТекСтрока Из ОписаниеПечатныхФорм Цикл
		Для каждого ТекНазначение Из ТекСтрока.Назначение Цикл
			НазначениеИмя						= СокрЛП(Прав(ТекНазначение.Значение, СтрДлина(ТекНазначение.Значение) - Найти(ТекНазначение.Значение, ".")));
			НазначениеИндекс					= Строка(Формат(СписокНазначений.Индекс(СписокНазначений.НайтиПоЗначению(ТекНазначение.Значение)) + 1, "ЧЦ=2; ЧВН=; ЧГ=0"));
			
			ИмяКоманды							= ТекСтрока.Макет + "_" + НазначениеИндекс;
			
			НоваяКоманда 						= Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие 				= "Печать";
			НоваяКоманда.Заголовок				= ТекНазначение.Значение + " - " + ТекСтрока.МакетПредставление;
			
			ЭлементКнопкаПодменю 				= Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.МенюПечать);
			ЭлементКнопкаПодменю.Вид 			= ВидКнопкиФормы.КнопкаКоманднойПанели;
			ЭлементКнопкаПодменю.ИмяКоманды 	= НоваяКоманда.Имя;
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры //ASTRA ГайнаДИ AddOn End

&НаКлиенте
Процедура Печать(Команда) //9428 ASTRA ГайнаДИ AddOn Begin
	
	ВыбранныйМакет = Лев(Команда.Имя, СтрДлина(Команда.Имя) - 3);
	ТекущееНазначение = СписокНазначений[Число(Прав(Команда.Имя, 2)) - 1].Значение;
	
	НайденныеСтроки = ОписаниеПечатныхФорм.НайтиСтроки(Новый Структура("Макет", ВыбранныйМакет));	
	Если НЕ НайденныеСтроки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОткрытьФорму(ТекущееНазначение + ".ФормаВыбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ПечатьЗавершение", ЭтаФорма, Новый Структура("ВыбранныйМакет", ВыбранныйМакет)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры //ASTRA ГайнаДИ AddOn End

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт //9428 ASTRA ГайнаДИ AddOn Begin
	
	Если Результат = Неопределено 
		ИЛИ НЕ Результат.Количество()	Тогда
		Возврат;
	КонецЕсли;
	
	МассивТабличныхДокументов = ПолучитьПечатнуюФорму(Результат, ДополнительныеПараметры.ВыбранныйМакет);
	Для каждого ТабДокумент Из МассивТабличныхДокументов Цикл
		Если ТабДокумент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТабДокумент.АвтоМасштаб            	= Истина;
		ТабДокумент.ОтображатьЗаголовки    	= Ложь;
		ТабДокумент.ОтображатьСетку        	= Ложь;
		ТабДокумент.ТолькоПросмотр         	= Истина;
		
		ТабДокумент.Показать();
	КонецЦикла;

КонецПроцедуры  //ASTRA ГайнаДИ AddOn End

&НаСервере
Функция ПолучитьПечатнуюФорму(МассивОбъектов, ИмяМакета) //9428 ASTRA ГайнаДИ AddOn Begin
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	КоллекцияПечатныхФорм	= УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ИмяМакета);
	
	ПараметрыВывода			= УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	ОбъектыПечати			= Новый СписокЗначений;
	
	ТекОбъект.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	Возврат КоллекцияПечатныхФорм.ВыгрузитьКолонку("ТабличныйДокумент");
	
КонецФункции //ASTRA ГайнаДИ AddOn End

&НаКлиенте
Процедура АстраНажатие(Элемент) //9428 ASTRA ГайнаДИ AddOn Begin
	
	ЗапуститьПриложение("http://www.astra1c.ru");
	
КонецПроцедуры //ASTRA ГайнаДИ AddOn End

