#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область РегистрацияОбработки
	
	Перем ОписаниеПечатныхФорм Экспорт;
	Перем МассивНазначений Экспорт;
	Перем ИмяОбработки, Синоним, Комментарий; 
	
	Функция СведенияОВнешнейОбработке() Экспорт
		
		ПараметрыРегистрации = Новый Структура;
		
		ПараметрыРегистрации.Вставить("Вид", ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма());
		ПараметрыРегистрации.Вставить("Назначение", МассивНазначений); 
		ПараметрыРегистрации.Вставить("Наименование", Синоним);
		ПараметрыРегистрации.Вставить("Версия", "2.4.8");
		ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
		ПараметрыРегистрации.Вставить("ВерсияБСП", СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
		ПараметрыРегистрации.Вставить("Информация", ?(ЗначениеЗаполнено(Комментарий), Комментарий, Синоним));
		
		ТаблицаКоманд = ПолучитьТаблицуКоманд();
		
		Для каждого ТекСтрока Из ОписаниеПечатныхФорм Цикл
			ДобавитьКоманду(ТаблицаКоманд, ТекСтрока.МакетПредставление, ТекСтрока.Макет, "ВызовСерверногоМетода", , "ПечатьMXL");	
		КонецЦикла;
		
		ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
		
		Возврат ПараметрыРегистрации;
		
	КонецФункции
	
	Функция ПолучитьТаблицуКоманд()	
		Команды = Новый ТаблицаЗначений;
		Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
		Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
		Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
		Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
		Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
		
		Возврат Команды;
		
	КонецФункции
	
	Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")	
		НоваяКоманда = ТаблицаКоманд.Добавить();
		НоваяКоманда.Представление = Представление;
		НоваяКоманда.Идентификатор = Идентификатор;
		НоваяКоманда.Использование = Использование;
		НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
		НоваяКоманда.Модификатор = Модификатор;
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область Печать
	
	Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ПараметрыПечати = Неопределено) Экспорт
		
		Если ПараметрыПечати = Неопределено Тогда
			ПараметрыПечати = Новый Структура;
		КонецЕсли;	
		
		ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;		
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТрудовойДоговор") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ТрудовойДоговор", 
			"Трудовой договор (режим сменный)", 
			СформироватьПечатнуюФормуТрудовойДоговорСменный(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ТрудовойДоговор"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТрудовойДоговорСрочныйУпаковщик") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ТрудовойДоговорСрочныйУпаковщик", 
			"Трудовой договор (срочный) Упаковщик", 
			СформироватьПечатнуюФормуТрудовойДоговорСрочныйУпаковщик(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ТрудовойДоговорСрочныйУпаковщик"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТрудовойДоговор_Общий") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ТрудовойДоговор_Общий", 
			"Трудовой договор (режим общий)", 
			СформироватьПечатнуюФормуТрудовойДоговорОбщий(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ТрудовойДоговор_Общий"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСрокиВыплаты") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСрокиВыплаты", 
			"Дополнительное соглашение к Трудовому договору (сроки выплаты)", 
			СформироватьПечатнуюФормуТрудовойДоговорДоп(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСрокиВыплаты"));
		КонецЕсли;
		
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИзмАдреса") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИзмАдреса", 
			"Дополнительное соглашение к Трудовому договору (изм. адреса)", 
			СформироватьПечатнуюФормуТрудовойДоговорДоп(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИзмАдреса"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруУточненияУсловийТруда") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруУточненияУсловийТруда", 
			"Дополнительное соглашение к Трудовому договору (уточнения условий труда)", 
			СформироватьПечатнуюФормуТрудовойДоговорДоп(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруУточненияУсловийТруда"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТрудовойДоговор_ТКП") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ТрудовойДоговор_ТКП", 
			"ТК Пермский - Трудовой договор (режим сменный)", 
			СформироватьПечатнуюФормуТрудовойДоговорСменныйТКП(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ТрудовойДоговор_ТКП"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТрудовойДоговор_Общий_ТКП") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ТрудовойДоговор_Общий_ТКП", 
			"ТК Пермский - Трудовой договор (режим общий)", 
			СформироватьПечатнуюФормуТрудовойДоговорОбщийТКП(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ТрудовойДоговор_Общий_ТКП"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Приложение2КТрудовомуДоговоруОНеразглашенииИнформации_ТКП") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_Приложение2КТрудовомуДоговоруОНеразглашенииИнформации_ТКП", 
			"ТК Пермский - Приложение №2 к Трудовому договору Обязательство о неразглашении информации", 
			СформироватьПечатнуюФормуТрудовойДоговор(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_Приложение2КТрудовомуДоговоруОНеразглашенииИнформации_ТКП"));
		КонецЕсли;	
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Приложение3КТрудовомуДоговоруОНеразглашенииПерсональныхДанных_ТКП") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_Приложение3КТрудовомуДоговоруОНеразглашенииПерсональныхДанных_ТКП", 
			"ТК Пермский - Приложение №3 к Трудовому договору Обязательство о неразглашении персональных данных", 
			СформироватьПечатнуюФормуТрудовойДоговор(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_Приложение3КТрудовомуДоговоруОНеразглашенииПерсональныхДанных_ТКП"));
		КонецЕсли;		
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных_ТКП") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных_ТКП", 
			"ТК Пермский - Согласие на обработку персональных данных", 
			СформироватьПечатнуюФормуТрудовойДоговор(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных_ТКП"));
		КонецЕсли;	
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСуммаДолжность") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСуммаДолжность", 
			"Дополнительное соглашение к Трудовому договору (должность, размер выплаты)", 
			СформироватьПечатнуюФормуТрудовойДоговорДоп(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСуммаДолжность"));
		КонецЕсли; 
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТрудовойДоговор_ОбщийАУП") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ТрудовойДоговор_ОбщийАУП", 
			"Трудовой договор (режим общий) АУП", 
			СформироватьПечатнуюФормуТрудовойДоговорОбщий(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ТрудовойДоговор_ОбщийАУП"));
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация", 
			"Дополнительное соглашение к Трудовому договору (индексация)", 
			СформироватьПечатнуюФормуТрудовойДоговорДоп(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация"));
		КонецЕсли;    
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруCОУТ") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруCОУТ", 
			"Дополнительное соглашение к Трудовому договору (СОУТ)", 
			СформироватьПечатнуюФормуТрудовойДоговорДоп(МассивОбъектов, ОбъектыПечати, Неопределено, ПараметрыПечати, "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруCОУТ"));
		КонецЕсли;

		
		ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
		
	КонецПроцедуры 
	
	#КонецОбласти
	
	#Область ТрудовойДоговор
	
	Функция СформироватьПечатнуюФормуТрудовойДоговор(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати, Макет) //9428 ASTRA ГайнаДИ AddOn Begin
		
		УстановитьПривилегированныйРежим(Истина);
		
		ВалютаСсылка = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ИмяПараметровПечати = СтрЗаменить(Макет, "ПФ_MXL_", "ПАРАМЕТРЫ_ПЕЧАТИ_");
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПолеСверху = 5;
		ТабличныйДокумент.ПолеСнизу = 5;
		ТабличныйДокумент.ПолеСлева = 10;
		ТабличныйДокумент.ПолеСправа = 5;
		ТабличныйДокумент.КоличествоЭкземпляров = 2;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 4;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 4;
		
		ИмяМакета = Макет;
		
		Макет = ПолучитьМакет(Макет);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТрудовойДоговор(МассивОбъектов);
		
		ДанныеДоговоров = ДанныеДляПечати.ДанныеДоговоров;
		
		ДанныеФизЛицСотрудников = ДанныеДляПечати.ДанныеФизическихЛицСотрудников;
		
		ПервыйОбъект = Истина;
		Для каждого СтрокаДереваПервогоУровня Из ДанныеДоговоров Цикл
			
			ДанныеДетальныхЗаписей = СтрокаДереваПервогоУровня.Строки[0];
			Если ДанныеДетальныхЗаписей.Строки.Количество() > 0 Тогда
				ДанныеДоговора = ДанныеДетальныхЗаписей.Строки[0];
			Иначе
				ДанныеДоговора = ДанныеДетальныхЗаписей;
			КонецЕсли;
			
			//Для печати комплектов
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеДоговора.РаботаСотрудник,"Ссылка");
				Если КомплектПечатиПоСсылке = Неопределено Тогда
					КомплектПечатиПоСсылке = КомплектыПечати[0];
				КонецЕсли;
				Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
					Продолжить
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПервыйОбъект Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйОбъект      = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			////// Заполнение данных объекта
			
			ДанныеОбъекта = Новый Структура;
			
			// Длительность основного отпуска
			ПараметрыПредметаИсчисления = ", , , , , , , , 0";
			ДлительностьОсновногоОтпуска = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска), ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска, 0);
			ДлительностьОсновногоОтпускаПрописью = "";
			ДлительностьОсновногоОтпускаПрописью = НРег(ЧислоПрописью(ОКР(ДлительностьОсновногоОтпуска), "Л=ru_RU;НП=Ложь;НД=Ложь", ПараметрыПредметаИсчисления));
			
			// Сумма оклада (тарифная ставка)
			ОкладСумма = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя), ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя , ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаРазмер), ДанныеДоговора.РаботаОплатаТрудаРазмер, 0));
			ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОкладСумма, ВалютаСсылка);
			
			ТекущиеДанныеФизЛицаСотрудника = ПолучитьСтрокуТаблицы(ДанныеФизЛицСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДополнитьДанныеОбъектаИнформациейОбОрганизации(ДанныеОбъекта, Неопределено, ДанныеДоговора.РаботаДатаПриема, ТекущиеДанныеФизЛицаСотрудника);
			
			КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан, ДокументКодПодразделения", ДанныеДоговора.РаботаДатаПриема);
			ТекущиеКадровыеДанныеФизическихЛиц = ПолучитьСтрокуТаблицы(КадровыеДанныеФизическихЛиц, Новый Структура("ФизическоеЛицо", ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо));
			
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ДанныеДоговора.РаботаСотрудник, "КлассУсловийТруда");
			ТекущиеКадровыеДанныеСотрудников = ПолучитьСтрокуТаблицы(КадровыеДанныеСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДанныеОбъекта.Вставить("ДоговорНомер",                         ДанныеДоговора.РаботаТрудовойДоговорНомерНаПечать);
			ДанныеОбъекта.Вставить("ДоговорДата",                          СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаТрудовойДоговорДатаОформления), ДанныеДоговора.РаботаТрудовойДоговорДатаОформления, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ДатаПриема",                           СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаДатаПриема), ДанныеДоговора.РаботаДатаПриема, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ИспытательныйСрокМесяцев",             СтрокаДоговора(ДанныеДоговора.РаботаТрудовойДоговорДлительностьИспытательногоСрока,, Истина, ));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпускаПрописью", СтрокаДоговора(ПервоеСловоСЗаглавной(ДлительностьОсновногоОтпускаПрописью)));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпуска",         СтрокаДоговора(ДлительностьОсновногоОтпуска,, Истина, ));
			ДанныеОбъекта.Вставить("ОкладСумма",                           СтрокаДоговора(ФормированиеПечатныхФорм.ФорматСумм(ОкладСумма, ВалютаСсылка, "0")));
			ДанныеОбъекта.Вставить("ОкладСуммаПрописью",                   СтрокаДоговора(ОкладСуммаПрописью));
			ДанныеОбъекта.Вставить("ОрганизацияГородФактическогоАдреса",   СтрокаДоговора(ДанныеДоговора.РаботаОрганизацияГородФактическогоАдреса));
			// 12100 ASTRA (&) Saim 15.11.2019 8:19:26 AddOn Begin
			//* Неидентифицированные изменения при обновлении
			//ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как типовая функция возвращает Подразделение в виде справочника ссылки
			ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать));
			// 12100 ASTRA (&) Saim 15.11.2019 8:19:26 AddOn End
			ДанныеОбъекта.Вставить("КлассУсловийТруда",                    СтрокаДоговора(ТекущиеКадровыеДанныеСотрудников.КлассУсловийТруда));
			
			ДанныеОбъекта.Вставить("Сотрудник",                  ДанныеДоговора.РаботаСотрудник);
			ДанныеОбъекта.Вставить("СотрудникФИОПолные",         СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеФИОФамилияИмяОтчество));
			ДанныеОбъекта.Вставить("СотрудникФИОИнициалы",       СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо)));
			// 12100 ASTRA (&) Saim 15.11.2019 8:22:44 AddOn Begin
			//* Неидентифицированные изменения при обновлении
			//ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			//ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование, Истина));
			ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность, Истина));
			// 12100 ASTRA (&) Saim 15.11.2019 8:22:44 AddOn End
			ДанныеОбъекта.Вставить("СотрудникСНИЛС",             СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеСтраховойНомерПФР)); // СНИЛС - это "Страховой номер ПФР"
			ДанныеОбъекта.Вставить("СотрудникИменуемое",         ?(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский, "именуемая", "именуемый"));
			ДанныеОбъекта.Вставить("СотрудникДатаРождения",      СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоДатаРождения));
			ДанныеОбъекта.Вставить("СотрудникПаспортСерия",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументСерия));
			ДанныеОбъекта.Вставить("СотрудникПаспортНомер",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументНомер));
			ДанныеОбъекта.Вставить("СотрудникПаспортКемВыдан",   СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКемВыдан));
			ДанныеОбъекта.Вставить("СотрудникПаспортДатаВыдачи", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументДатаВыдачи));
			ДанныеОбъекта.Вставить("СотрудникАдресПоПрописке",   СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.АдресПоПрописке));
			ДанныеОбъекта.Вставить("СотрудникИНН",               СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоИНН));
			
			ДанныеОбъекта.Вставить("СотрудникПаспортКодПодразделения", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКодПодразделения)); //Для ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных_ТКП
			ДанныеОбъекта.Вставить("СотрудникФИОПолныеРП", ""); //Для ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных_ТКП
			ФизическиеЛицаЗарплатаКадры.Просклонять(СтрокаДоговора(СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "Наименование"))), 2, ДанныеОбъекта.СотрудникФИОПолныеРП, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо.Пол);
			
			
			////// Заполнение данных объекта
			
			////// Вывод областей макета
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьТекст     = Макет.ПолучитьОбласть("Текст");
			ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
			
			// Вывод данных в заголовок договора
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			// Вывод данных в текст договора
			// Выведем "ОбластьТекст" в табличный документ фрагментами, с целью более полного заполнения формата страницы
			ОбластьТекст.Параметры.Заполнить(ДанныеОбъекта);
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьТекст, ТабличныйДокумент);
			
			// Вывод данных в подписи договора
			// Выведем "ОбластьПодписи" в табличный документ по-строчно, с целью более полного заполнения формата страницы
			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);
			Если ИмяМакета = "ПФ_MXL_ТрудовойДоговор" Тогда
				
				// Для макета "ТрудовойДоговор" подписи всегда должны выводиться на отдельной странице			
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
				
			Иначе
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			КонецЕсли;
			
			////// Вывод областей макета
			
			// Выведем нужное количество экземпляров (при печати комплектов)
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
				ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
				Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьКопирования);
				КонецЦикла;
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДоговора.РаботаСотрудник);
			
		КонецЦикла;
		
		// На всякий случай добавим еще сюда
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция СформироватьПечатнуюФормуТрудовойДоговорСрочныйУпаковщик(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати, Макет) //9428 ASTRA ГайнаДИ AddOn Begin
		
		УстановитьПривилегированныйРежим(Истина);
		
		ВалютаСсылка = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ИмяПараметровПечати = СтрЗаменить(Макет, "ПФ_MXL_", "ПАРАМЕТРЫ_ПЕЧАТИ_");
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПолеСверху = 5;
		ТабличныйДокумент.ПолеСнизу = 5;
		ТабличныйДокумент.ПолеСлева = 10;
		ТабличныйДокумент.ПолеСправа = 5;
		ТабличныйДокумент.КоличествоЭкземпляров = 2;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 4;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 4;
		
		ИмяМакета = Макет;
		
		Макет = ПолучитьМакет(Макет);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТрудовойДоговор(МассивОбъектов);
		
		ДанныеДоговоров = ДанныеДляПечати.ДанныеДоговоров;
		
		ДанныеФизЛицСотрудников = ДанныеДляПечати.ДанныеФизическихЛицСотрудников;
		
		ПервыйОбъект = Истина;
		Для каждого СтрокаДереваПервогоУровня Из ДанныеДоговоров Цикл
			
			ДанныеДетальныхЗаписей = СтрокаДереваПервогоУровня.Строки[0];
			Если ДанныеДетальныхЗаписей.Строки.Количество() > 0 Тогда
				ДанныеДоговора = ДанныеДетальныхЗаписей.Строки[0];
			Иначе
				ДанныеДоговора = ДанныеДетальныхЗаписей;
			КонецЕсли;
			
			//Для печати комплектов
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеДоговора.РаботаСотрудник,"Ссылка");
				Если КомплектПечатиПоСсылке = Неопределено Тогда
					КомплектПечатиПоСсылке = КомплектыПечати[0];
				КонецЕсли;
				Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
					Продолжить
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПервыйОбъект Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйОбъект      = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			////// Заполнение данных объекта
			
			ДанныеОбъекта = Новый Структура;
			
			// Длительность основного отпуска
			ПараметрыПредметаИсчисления = ", , , , , , , , 0";
			ДлительностьОсновногоОтпуска = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска), ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска, 0);
			ДлительностьОсновногоОтпускаПрописью = "";
			ДлительностьОсновногоОтпускаПрописью = НРег(ЧислоПрописью(ОКР(ДлительностьОсновногоОтпуска), "Л=ru_RU;НП=Ложь;НД=Ложь", ПараметрыПредметаИсчисления));
			
			// Сумма оклада (тарифная ставка)
			ОкладСумма = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя), ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя , ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаРазмер), ДанныеДоговора.РаботаОплатаТрудаРазмер, 0));
			ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОкладСумма, ВалютаСсылка);
			
			ТекущиеДанныеФизЛицаСотрудника = ПолучитьСтрокуТаблицы(ДанныеФизЛицСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДополнитьДанныеОбъектаИнформациейОбОрганизации(ДанныеОбъекта, Неопределено, ДанныеДоговора.РаботаДатаПриема, ТекущиеДанныеФизЛицаСотрудника);
			
			КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан, ДокументКодПодразделения", ДанныеДоговора.РаботаДатаПриема);
			ТекущиеКадровыеДанныеФизическихЛиц = ПолучитьСтрокуТаблицы(КадровыеДанныеФизическихЛиц, Новый Структура("ФизическоеЛицо", ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо));
			
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ДанныеДоговора.РаботаСотрудник, "КлассУсловийТруда");
			ТекущиеКадровыеДанныеСотрудников = ПолучитьСтрокуТаблицы(КадровыеДанныеСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДанныеОбъекта.Вставить("ДоговорНомер",                         ДанныеДоговора.РаботаТрудовойДоговорНомерНаПечать);
			ДанныеОбъекта.Вставить("ДоговорДатаОкончания",                 Формат(ДанныеДоговора.РаботаТрудовойДоговорДатаОкончания, "ДЛФ=Д"));
			ДанныеОбъекта.Вставить("ДоговорДата",                          СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаТрудовойДоговорДатаОформления), ДанныеДоговора.РаботаТрудовойДоговорДатаОформления, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ДатаПриема",                           СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаДатаПриема), ДанныеДоговора.РаботаДатаПриема, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ИспытательныйСрокМесяцев",             СтрокаДоговора(ДанныеДоговора.РаботаТрудовойДоговорДлительностьИспытательногоСрока,, Истина, ));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпускаПрописью", СтрокаДоговора(ПервоеСловоСЗаглавной(ДлительностьОсновногоОтпускаПрописью)));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпуска",         СтрокаДоговора(ДлительностьОсновногоОтпуска,, Истина, ));
			ДанныеОбъекта.Вставить("ОкладСумма",                           СтрокаДоговора(ФормированиеПечатныхФорм.ФорматСумм(ОкладСумма, ВалютаСсылка, "0")));
			ДанныеОбъекта.Вставить("ОкладСуммаПрописью",                   СтрокаДоговора(ОкладСуммаПрописью));
			ДанныеОбъекта.Вставить("ОрганизацияГородФактическогоАдреса",   СтрокаДоговора(ДанныеДоговора.РаботаОрганизацияГородФактическогоАдреса));
			// 12100 ASTRA (&) Saim 15.11.2019 8:19:26 AddOn Begin
			//* Неидентифицированные изменения при обновлении
			//ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как типовая функция возвращает Подразделение в виде справочника ссылки
			ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать));
			// 12100 ASTRA (&) Saim 15.11.2019 8:19:26 AddOn End
			ДанныеОбъекта.Вставить("КлассУсловийТруда",                    СтрокаДоговора(ТекущиеКадровыеДанныеСотрудников.КлассУсловийТруда));
			
			ДанныеОбъекта.Вставить("Сотрудник",                  ДанныеДоговора.РаботаСотрудник);
			ДанныеОбъекта.Вставить("СотрудникФИОПолные",         СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеФИОФамилияИмяОтчество));
			ДанныеОбъекта.Вставить("СотрудникФИОИнициалы",       СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо)));
			// 12100 ASTRA (&) Saim 15.11.2019 8:22:44 AddOn Begin
			//* Неидентифицированные изменения при обновлении
			//ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			//ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование, Истина));
			ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность, Истина));
			// 12100 ASTRA (&) Saim 15.11.2019 8:22:44 AddOn End
			ДанныеОбъекта.Вставить("СотрудникСНИЛС",             СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеСтраховойНомерПФР)); // СНИЛС - это "Страховой номер ПФР"
			ДанныеОбъекта.Вставить("СотрудникИменуемое",         ?(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский, "именуемая", "именуемый"));
			ДанныеОбъекта.Вставить("СотрудникДатаРождения",      СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоДатаРождения));
			ДанныеОбъекта.Вставить("СотрудникПаспортСерия",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументСерия));
			ДанныеОбъекта.Вставить("СотрудникПаспортНомер",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументНомер));
			ДанныеОбъекта.Вставить("СотрудникПаспортКемВыдан",   СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКемВыдан));
			ДанныеОбъекта.Вставить("СотрудникПаспортДатаВыдачи", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументДатаВыдачи));
			ДанныеОбъекта.Вставить("СотрудникАдресПоПрописке",   СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.АдресПоПрописке));
			ДанныеОбъекта.Вставить("СотрудникИНН",               СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоИНН));
			
			ДанныеОбъекта.Вставить("СотрудникПаспортКодПодразделения", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКодПодразделения)); //Для ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных_ТКП
			ДанныеОбъекта.Вставить("СотрудникФИОПолныеРП", ""); //Для ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных_ТКП
			ФизическиеЛицаЗарплатаКадры.Просклонять(СтрокаДоговора(СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "Наименование"))), 2, ДанныеОбъекта.СотрудникФИОПолныеРП, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо.Пол);
			
			
			////// Заполнение данных объекта
			
			////// Вывод областей макета
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьТекст     = Макет.ПолучитьОбласть("Текст");
			ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
			
			// Вывод данных в заголовок договора
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			// Вывод данных в текст договора
			// Выведем "ОбластьТекст" в табличный документ фрагментами, с целью более полного заполнения формата страницы
			ОбластьТекст.Параметры.Заполнить(ДанныеОбъекта);
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьТекст, ТабличныйДокумент);
			
			// Вывод данных в подписи договора
			// Выведем "ОбластьПодписи" в табличный документ по-строчно, с целью более полного заполнения формата страницы
			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);
			Если ИмяМакета = "ПФ_MXL_ТрудовойДоговор" Тогда
				
				// Для макета "ТрудовойДоговор" подписи всегда должны выводиться на отдельной странице			
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
				
			Иначе
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			КонецЕсли;
			
			////// Вывод областей макета
			
			// Выведем нужное количество экземпляров (при печати комплектов)
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
				ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
				Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьКопирования);
				КонецЦикла;
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДоговора.РаботаСотрудник);
			
		КонецЦикла;
		
		// На всякий случай добавим еще сюда
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция СформироватьПечатнуюФормуТрудовойДоговорСменный(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати, Макет) //9428 ASTRA ГайнаДИ AddOn Begin
		
		УстановитьПривилегированныйРежим(Истина);
		
		ВалютаСсылка = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ИмяПараметровПечати = СтрЗаменить(Макет, "ПФ_MXL_", "ПАРАМЕТРЫ_ПЕЧАТИ_");
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПолеСверху = 5;
		ТабличныйДокумент.ПолеСнизу = 5;
		ТабличныйДокумент.ПолеСлева = 10;
		ТабличныйДокумент.ПолеСправа = 5;
		ТабличныйДокумент.КоличествоЭкземпляров = 2;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 4;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 4;
		
		ИмяМакета = Макет;
		
		Макет = ПолучитьМакет(Макет);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТрудовойДоговор(МассивОбъектов,Истина);
		
		ДанныеДоговоров = ДанныеДляПечати.ДанныеДоговоров;
		
		ДанныеФизЛицСотрудников = ДанныеДляПечати.ДанныеФизическихЛицСотрудников;
		
		ПервыйОбъект = Истина;
		Для каждого СтрокаДереваПервогоУровня Из ДанныеДоговоров Цикл
			
			ДанныеДетальныхЗаписей = СтрокаДереваПервогоУровня.Строки[0];
			Если ДанныеДетальныхЗаписей.Строки.Количество() > 0 Тогда
				ДанныеДоговора = ДанныеДетальныхЗаписей.Строки[0];
			Иначе
				ДанныеДоговора = ДанныеДетальныхЗаписей;
			КонецЕсли;
			
			//Для печати комплектов
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеДоговора.РаботаСотрудник,"Ссылка");
				Если КомплектПечатиПоСсылке = Неопределено Тогда
					КомплектПечатиПоСсылке = КомплектыПечати[0];
				КонецЕсли;
				Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
					Продолжить
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПервыйОбъект Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйОбъект      = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			////// Заполнение данных объекта
			
			ДанныеОбъекта = Новый Структура;
			
			// Длительность основного отпуска
			ПараметрыПредметаИсчисления = ", , , , , , , , 0";
			ДлительностьОсновногоОтпуска = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска), ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска, 0);
			ДлительностьОсновногоОтпускаПрописью = "";
			ДлительностьОсновногоОтпускаПрописью = НРег(ЧислоПрописью(ОКР(ДлительностьОсновногоОтпуска), "Л=ru_RU;НП=Ложь;НД=Ложь", ПараметрыПредметаИсчисления));
			
			// Сумма оклада (тарифная ставка)		
			ФормаОплатыТруда = ?(СтрНайти(ДанныеДоговора.РаботаОплатаТрудаНачисление.ФормулаРасчета,"ТарифнаяСтавкаЧасовая")>0,"почасовая оплата труда из расчета","должностной оклад в размере");
			ОкладСумма = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя), ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя , ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаРазмер), ДанныеДоговора.РаботаОплатаТрудаРазмер, 0));
			ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОкладСумма, ВалютаСсылка);
			
			ТекущиеДанныеФизЛицаСотрудника = ПолучитьСтрокуТаблицы(ДанныеФизЛицСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДополнитьДанныеОбъектаИнформациейОбОрганизации(ДанныеОбъекта, Неопределено, ДанныеДоговора.РаботаДатаПриема, ТекущиеДанныеФизЛицаСотрудника);
			
			КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан", ДанныеДоговора.РаботаДатаПриема);
			ТекущиеКадровыеДанныеФизическихЛиц = ПолучитьСтрокуТаблицы(КадровыеДанныеФизическихЛиц, Новый Структура("ФизическоеЛицо", ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо));
			
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ДанныеДоговора.РаботаСотрудник, "КлассУсловийТруда");
			ТекущиеКадровыеДанныеСотрудников = ПолучитьСтрокуТаблицы(КадровыеДанныеСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДанныеОбъекта.Вставить("ДоговорНомер",                         ДанныеДоговора.РаботаТрудовойДоговорНомерНаПечать);
			ДанныеОбъекта.Вставить("ДоговорДата",                          СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаТрудовойДоговорДатаОформления), ДанныеДоговора.РаботаТрудовойДоговорДатаОформления, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ДатаПриема",                           СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаДатаПриема), ДанныеДоговора.РаботаДатаПриема, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ИспытательныйСрокМесяцев",             СтрокаДоговора(ДанныеДоговора.РаботаТрудовойДоговорДлительностьИспытательногоСрока,, Истина, ));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпускаПрописью", СтрокаДоговора(ПервоеСловоСЗаглавной(ДлительностьОсновногоОтпускаПрописью)));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпуска",         СтрокаДоговора(ДлительностьОсновногоОтпуска,, Истина, ));
			ДанныеОбъекта.Вставить("ОкладСумма",                           СтрокаДоговора(ФормированиеПечатныхФорм.ФорматСумм(ОкладСумма, ВалютаСсылка, "0")));
			ДанныеОбъекта.Вставить("ОкладСуммаПрописью",                   СтрокаДоговора(ОкладСуммаПрописью));
			ДанныеОбъекта.Вставить("ОрганизацияГородФактическогоАдреса",   СтрокаДоговора(ДанныеДоговора.РаботаОрганизацияГородФактическогоАдреса));
			ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как типовая функция возвращает Подразделение в виде справочника ссылки
			ДанныеОбъекта.Вставить("КлассУсловийТруда",                    СтрокаДоговора(ТекущиеКадровыеДанныеСотрудников.КлассУсловийТруда));
			
			ДанныеОбъекта.Вставить("Сотрудник",                  ДанныеДоговора.РаботаСотрудник);
			ДанныеОбъекта.Вставить("СотрудникФИОПолные",         СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеФИОФамилияИмяОтчество));
			ДанныеОбъекта.Вставить("СотрудникФИОИнициалы",       СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо)));
			ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование, Истина));
			ДанныеОбъекта.Вставить("СотрудникСНИЛС",             СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеСтраховойНомерПФР)); // СНИЛС - это "Страховой номер ПФР"
			ДанныеОбъекта.Вставить("СотрудникИменуемое",         ?(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский, "именуемая", "именуемый"));
			ДанныеОбъекта.Вставить("СотрудникДатаРождения",      СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоДатаРождения));
			ДанныеОбъекта.Вставить("СотрудникПаспортСерия",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументСерия));
			ДанныеОбъекта.Вставить("СотрудникПаспортНомер",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументНомер));
			ДанныеОбъекта.Вставить("СотрудникПаспортКемВыдан",   СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКемВыдан));
			ДанныеОбъекта.Вставить("СотрудникПаспортДатаВыдачи", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументДатаВыдачи));
			ДанныеОбъекта.Вставить("СотрудникАдресПоПрописке",   СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.АдресПоПрописке));
			ДанныеОбъекта.Вставить("СотрудникИНН",               СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоИНН));
			ДанныеОбъекта.Вставить("ТекущаяДата",   			 СтрокаДоговора(ТекущаяДатаСеанса()));
			ДанныеОбъекта.Вставить("ФормаОплатыТруда",   		 СтрокаДоговора(ФормаОплатыТруда));
			
			
			////// Заполнение данных объекта
			
			////// Вывод областей макета
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");			
			ОбластьТекст     = Макет.ПолучитьОбласть("Текст");	  		
			ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
			
			// Вывод данных в заголовок договора
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			// Вывод данных в текст договора
			// Выведем "ОбластьТекст" в табличный документ фрагментами, с целью более полного заполнения формата страницы
			ОбластьТекст.Параметры.Заполнить(ДанныеОбъекта);
			
			//Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" и ДанныеДоговора.РаботаДатаПриема >= Дата("20191101") Тогда
			//	ОбластьТекст.Параметры.ОрганизацияАдресФактический = "429509, Чувашская Республика, сельское поселение Атлашевское, д.Кодеркасы, территория тепличный комплекс Новочебоксарский";	  						
			//КонецЕсли;		
			
			//Изменения с 31.01.2020:
			//1. Изменения в п.1.4
			//2. Изменения в п.3.2
			Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" И ДанныеДоговора.РаботаДатаПриема >= Дата("20200131") Тогда
				ОбластьТекст.Параметры.УсловияТруда = "Условия труда на рабочем месте Работника относятся к допустимым (2-й класс), выполняемая Работником по настоящему договору работа не относится к работе с тяжелыми, вредными и (или) опасными условиями труда. Рабочее место соответствует государственным требованиям охраны труда.";
				ОбластьТекст.Параметры.ВремяНачалоОкончанияРабот = "3.2. Время начала и окончания работы, время перерыва на обед, а также выходные дни  устанавливаются Правилами внутреннего трудового распорядка.";
			Иначе
				ОбластьТекст.Параметры.УсловияТруда = "На момент заключения трудового договора рабочее место не оценено. Оценка будет произведена в течение 12 месяцев, после чего условия труда будут доведены до Работника.";
				ОбластьТекст.Параметры.ВремяНачалоОкончанияРабот = "3.2. Время начала и окончания работы, время перерыва на обед устанавливаются Правилами внутреннего трудового распорядка.";
			КонецЕсли;
			
			//Изменения с 26.05.2020:
			//1. Изменения в п.4.2
			Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" И ДанныеДоговора.РаботаДатаПриема >= Дата("20200501") Тогда
				ОбластьТекст.Параметры.СрокВыплатыАванса = "29";
				ОбластьТекст.Параметры.СрокВыплатыЗарплаты = "14";
				Если СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование) = "Овощевод" Тогда
					ОбластьТекст.Параметры.РабочаяНеделя = "Работнику устанавливается 36 рабочая неделя.";
					ОбластьТекст.Параметры.УсловияОплатыТруда = "По настоящему договору Работнику установлена сдельная оплата труда исходя из сдельных расценок, установленных Работодателем за выполнение нормы труда определенной сложности (квалификации) за единицу времени без учета компенсационных, стимулирующих и социальных выплат.
					|Размер сдельной оплаты труда зависит исключительно от объема, количества и качества выполненных работ вне зависимости от отработанного времени.
					|При выполнении Работником работ различной квалификации его труд оплачивается по расценкам выполняемой им работы.
					|Работа в выходной или нерабочий праздничный день оплачивается не менее чем по двойным сдельным расценкам.";
				Иначе
					//Изменения с 28.05.2020:
					//ОбластьТекст.Параметры.РабочаяНеделя = "Работнику устанавливается рабочая неделя с предоставлением выходных дней по скользящему графику исходя из нормальной 40-часовой продолжительности рабочей недели.  График работ утверждается и доводится до сведения работника за 2 недели до начала работы.";
					Если ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский Тогда
						ОбластьТекст.Параметры.РабочаяНеделя = "Работнику устанавливается рабочая неделя с предоставлением выходных дней по скользящему графику исходя из нормальной 36-часовой продолжительности рабочей недели.  График работ утверждается и доводится до сведения работника за 2 недели до начала работы.";
					Иначе
						ОбластьТекст.Параметры.РабочаяНеделя = "Работнику устанавливается рабочая неделя с предоставлением выходных дней по скользящему графику исходя из нормальной 40-часовой продолжительности рабочей недели.  График работ утверждается и доводится до сведения работника за 2 недели до начала работы.";
					КонецЕсли;		
					ОбластьТекст.Параметры.УсловияОплатыТруда = "Работнику устанавливается " + ДанныеОбъекта.ФормаОплатыТруда + " " + ДанныеОбъекта.ОкладСумма + " (" + ДанныеОбъекта.ОкладСуммаПрописью +").";
				КонецЕсли;
			Иначе
				ОбластьТекст.Параметры.СрокВыплатыАванса = "25";
				ОбластьТекст.Параметры.СрокВыплатыЗарплаты = "10";
				ОбластьТекст.Параметры.РабочаяНеделя = "Работнику устанавливается рабочая неделя с предоставлением выходных дней по скользящему графику исходя из нормальной 40-часовой продолжительности рабочей недели.  График работ утверждается и доводится до сведения работника за 2 недели до начала работы.";
				ОбластьТекст.Параметры.УсловияОплатыТруда = "Работнику устанавливается " + ДанныеОбъекта.ФормаОплатыТруда + " " + ДанныеОбъекта.ОкладСумма + " (" + ДанныеОбъекта.ОкладСуммаПрописью +").";
			КонецЕсли;
			
			
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьТекст, ТабличныйДокумент);
			
			// Вывод данных в подписи договора
			// Выведем "ОбластьПодписи" в табличный документ по-строчно, с целью более полного заполнения формата страницы
			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);
			Если ИмяМакета = "ПФ_MXL_ТрудовойДоговор" или ИмяМакета = "ПФ_MXL_ТрудовойДоговор_Общий" Тогда
				
				// Для макета "ТрудовойДоговор" подписи всегда должны выводиться на отдельной странице			
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
				
			Иначе
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			КонецЕсли;
			
			////// Вывод областей макета
			
			// Выведем нужное количество экземпляров (при печати комплектов)
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
				ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
				Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьКопирования);
				КонецЦикла;
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДоговора.РаботаСотрудник);
			
		КонецЦикла;
		
		// На всякий случай добавим еще сюда
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция СформироватьПечатнуюФормуТрудовойДоговорСменныйТКП(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати, Макет) //18.05.21 АМ
		
		УстановитьПривилегированныйРежим(Истина);
		
		ВалютаСсылка = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ИмяПараметровПечати = СтрЗаменить(Макет, "ПФ_MXL_", "ПАРАМЕТРЫ_ПЕЧАТИ_");
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПолеСверху = 5;
		ТабличныйДокумент.ПолеСнизу = 5;
		ТабличныйДокумент.ПолеСлева = 10;
		ТабличныйДокумент.ПолеСправа = 5;
		ТабличныйДокумент.КоличествоЭкземпляров = 2;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 4;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 4;
		
		ИмяМакета = Макет;
		
		Макет = ПолучитьМакет(Макет);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТрудовойДоговор(МассивОбъектов,Истина);
		
		ДанныеДоговоров = ДанныеДляПечати.ДанныеДоговоров;
		
		ДанныеФизЛицСотрудников = ДанныеДляПечати.ДанныеФизическихЛицСотрудников;
		
		ПервыйОбъект = Истина;
		Для каждого СтрокаДереваПервогоУровня Из ДанныеДоговоров Цикл
			
			ДанныеДетальныхЗаписей = СтрокаДереваПервогоУровня.Строки[0];
			Если ДанныеДетальныхЗаписей.Строки.Количество() > 0 Тогда
				ДанныеДоговора = ДанныеДетальныхЗаписей.Строки[0];
			Иначе
				ДанныеДоговора = ДанныеДетальныхЗаписей;
			КонецЕсли;
			
			//Для печати комплектов
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеДоговора.РаботаСотрудник,"Ссылка");
				Если КомплектПечатиПоСсылке = Неопределено Тогда
					КомплектПечатиПоСсылке = КомплектыПечати[0];
				КонецЕсли;
				Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
					Продолжить
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПервыйОбъект Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйОбъект      = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			////// Заполнение данных объекта
			
			ДанныеОбъекта = Новый Структура;
			
			// Длительность основного отпуска
			ПараметрыПредметаИсчисления = ", , , , , , , , 0";
			ДлительностьОсновногоОтпуска = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска), ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска, 0);
			ДлительностьОсновногоОтпускаПрописью = "";
			ДлительностьОсновногоОтпускаПрописью = НРег(ЧислоПрописью(ОКР(ДлительностьОсновногоОтпуска), "Л=ru_RU;НП=Ложь;НД=Ложь", ПараметрыПредметаИсчисления));
			
			// Сумма оклада (тарифная ставка)		
			ФормаОплатыТруда = ?(СтрНайти(ДанныеДоговора.РаботаОплатаТрудаНачисление.ФормулаРасчета,"ТарифнаяСтавкаЧасовая")>0,"повременно-премиальная система оплаты труда: часовая тарифная ставка в размере","месячный должностной оклад в размере");		
			ОкладСумма = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя), ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя , ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаРазмер), ДанныеДоговора.РаботаОплатаТрудаРазмер, 0));
			ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОкладСумма, ВалютаСсылка);
			
			ТекущиеДанныеФизЛицаСотрудника = ПолучитьСтрокуТаблицы(ДанныеФизЛицСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДополнитьДанныеОбъектаИнформациейОбОрганизации(ДанныеОбъекта, Неопределено, ДанныеДоговора.РаботаДатаПриема, ТекущиеДанныеФизЛицаСотрудника);
			
			КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан", ДанныеДоговора.РаботаДатаПриема);
			ТекущиеКадровыеДанныеФизическихЛиц = ПолучитьСтрокуТаблицы(КадровыеДанныеФизическихЛиц, Новый Структура("ФизическоеЛицо", ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо));
			
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ДанныеДоговора.РаботаСотрудник, "КлассУсловийТруда, ГрафикРаботы");
			ТекущиеКадровыеДанныеСотрудников = ПолучитьСтрокуТаблицы(КадровыеДанныеСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДанныеОбъекта.Вставить("ДоговорНомер",                         ДанныеДоговора.РаботаТрудовойДоговорНомерНаПечать);
			ДанныеОбъекта.Вставить("ДоговорДата",                          СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаТрудовойДоговорДатаОформления), ДанныеДоговора.РаботаТрудовойДоговорДатаОформления, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ДатаПриема",                           СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаДатаПриема), ДанныеДоговора.РаботаДатаПриема, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ИспытательныйСрокМесяцев",             СтрокаДоговора(ДанныеДоговора.РаботаТрудовойДоговорДлительностьИспытательногоСрока,, Истина, ));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпускаПрописью", СтрокаДоговора(ПервоеСловоСЗаглавной(ДлительностьОсновногоОтпускаПрописью)));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпуска",         СтрокаДоговора(ДлительностьОсновногоОтпуска,, Истина, ));
			ДанныеОбъекта.Вставить("ОкладСумма",                           СтрокаДоговора(ФормированиеПечатныхФорм.ФорматСумм(ОкладСумма, ВалютаСсылка, "0")));
			ДанныеОбъекта.Вставить("ОкладСуммаПрописью",                   СтрокаДоговора(ОкладСуммаПрописью));
			ДанныеОбъекта.Вставить("ОрганизацияГородФактическогоАдреса",   СтрокаДоговора(ДанныеДоговора.РаботаОрганизацияГородФактическогоАдреса));
			ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как типовая функция возвращает Подразделение в виде справочника ссылки
			ДанныеОбъекта.Вставить("КлассУсловийТруда",                    СтрокаДоговора(ТекущиеКадровыеДанныеСотрудников.КлассУсловийТруда));
			
			ДанныеОбъекта.Вставить("Сотрудник",                  ДанныеДоговора.РаботаСотрудник);
			ДанныеОбъекта.Вставить("СотрудникФИОПолные",         СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеФИОФамилияИмяОтчество));
			ДанныеОбъекта.Вставить("СотрудникФИОИнициалы",       СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо)));
			ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование, Истина));
			ДанныеОбъекта.Вставить("СотрудникСНИЛС",             СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеСтраховойНомерПФР)); // СНИЛС - это "Страховой номер ПФР"
			ДанныеОбъекта.Вставить("СотрудникИменуемое",         ?(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский, "именуемая", "именуемый"));
			ДанныеОбъекта.Вставить("СотрудникДатаРождения",      СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоДатаРождения));
			ДанныеОбъекта.Вставить("СотрудникПаспортСерия",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументСерия));
			ДанныеОбъекта.Вставить("СотрудникПаспортНомер",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументНомер));
			ДанныеОбъекта.Вставить("СотрудникПаспортКемВыдан",   СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКемВыдан));
			ДанныеОбъекта.Вставить("СотрудникПаспортДатаВыдачи", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументДатаВыдачи));
			ДанныеОбъекта.Вставить("СотрудникАдресПоПрописке",   СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.АдресПоПрописке));
			ДанныеОбъекта.Вставить("СотрудникИНН",               СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоИНН));
			ДанныеОбъекта.Вставить("ТекущаяДата",   			 СтрокаДоговора(ТекущаяДатаСеанса()));
			ДанныеОбъекта.Вставить("ФормаОплатыТруда",   		 СтрокаДоговора(ФормаОплатыТруда));
			
			
			////// Заполнение данных объекта
			
			////// Вывод областей макета
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");			
			ОбластьТекст     = Макет.ПолучитьОбласть("Текст");	  		
			ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
			
			// Вывод данных в заголовок договора
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			// Вывод данных в текст договора
			// Выведем "ОбластьТекст" в табличный документ фрагментами, с целью более полного заполнения формата страницы
			ОбластьТекст.Параметры.Заполнить(ДанныеОбъекта);
			
			//Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" и ДанныеДоговора.РаботаДатаПриема >= Дата("20191101") Тогда
			//	ОбластьТекст.Параметры.ОрганизацияАдресФактический = "429509, Чувашская Республика, сельское поселение Атлашевское, д.Кодеркасы, территория тепличный комплекс Новочебоксарский";	  						
			//КонецЕсли;		
			
			ОбластьТекст.Параметры.СрокВыплатыАванса = "29";
			ОбластьТекст.Параметры.СрокВыплатыЗарплаты = "14";				
			ОбластьТекст.Параметры.ГрафикРаботы = ТекущиеКадровыеДанныеСотрудников.ГрафикРаботы.Наименование;
			
			/////////////////////////////////////////////////////////
			КоличествоЧасов = 0; //Для получения количества часов по графику. Если 24 часа, то обед 2 часа, иначе 1 час
			Для Каждого СтрокаДанныхОРабочихЧасах из ТекущиеКадровыеДанныеСотрудников.ГрафикРаботы.ДанныеОРабочихЧасах Цикл
				Если СтрокаДанныхОРабочихЧасах.ВидВремени = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.РаботаНочныеЧасы") Тогда
					КоличествоЧасов = СтрокаДанныхОРабочихЧасах.Часов + КоличествоЧасов;
				КонецЕсли;
			КонецЦикла;
			
			Если КоличествоЧасов = 8 Тогда
				ОбластьТекст.Параметры.ЧасыОбеда = "2 часа";
			Иначе
				ОбластьТекст.Параметры.ЧасыОбеда = "1 час";
			КонецЕсли;
			/////////////////////////////////////////////////////////
			
			//10.12.2021
			//ОбластьТекст.Параметры.УсловияОплатыТруда = "Работнику устанавливается " + ДанныеОбъекта.ФормаОплатыТруда + " " + ДанныеОбъекта.ОкладСумма + " (" + ДанныеОбъекта.ОкладСуммаПрописью +"). и премия в соответствии с действующим Положением об оплате труда ООО ТК «Пермский».";
			ОбластьТекст.Параметры.УсловияОплатыТруда = "Работнику устанавливается сдельно-премиальная система оплаты труда. Сдельные расценки, нормы выработки и размер премии устанавливаются в соответствии с действующим Положением об оплате труда ООО ТК «Пермский».";
			
			
			
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьТекст, ТабличныйДокумент);
			
			// Вывод данных в подписи договора
			// Выведем "ОбластьПодписи" в табличный документ по-строчно, с целью более полного заполнения формата страницы
			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);
			//Если ИмяМакета = "ПФ_MXL_ТрудовойДоговор_ТКП" или ИмяМакета = "ПФ_MXL_ТрудовойДоговор_Общий_ТКП" Тогда
			//	
			//	// Для макета "ТрудовойДоговор" подписи всегда должны выводиться на отдельной странице			
			//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			//	ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			//	
			//Иначе
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			//КонецЕсли;
			
			////// Вывод областей макета
			
			// Выведем нужное количество экземпляров (при печати комплектов)
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
				ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
				Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьКопирования);
				КонецЦикла;
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДоговора.РаботаСотрудник);
			
		КонецЦикла;
		
		// На всякий случай добавим еще сюда
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы]";
		ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;             
		
		
		Возврат ТабличныйДокумент;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция СформироватьПечатнуюФормуТрудовойДоговорОбщий(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати, Макет) //9428 ASTRA ГайнаДИ AddOn Begin
		
		УстановитьПривилегированныйРежим(Истина);
		
		ВалютаСсылка = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ИмяПараметровПечати = СтрЗаменить(Макет, "ПФ_MXL_", "ПАРАМЕТРЫ_ПЕЧАТИ_");
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПолеСверху = 5;
		ТабличныйДокумент.ПолеСнизу = 5;
		ТабличныйДокумент.ПолеСлева = 10;
		ТабличныйДокумент.ПолеСправа = 5;
		ТабличныйДокумент.КоличествоЭкземпляров = 2;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 4;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 4;
		
		ИмяМакета = Макет;
		
		Макет = ПолучитьМакет(Макет);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТрудовойДоговор(МассивОбъектов, Истина);
		
		ДанныеДоговоров = ДанныеДляПечати.ДанныеДоговоров;
		
		ДанныеФизЛицСотрудников = ДанныеДляПечати.ДанныеФизическихЛицСотрудников;
		
		ПервыйОбъект = Истина;
		Для каждого СтрокаДереваПервогоУровня Из ДанныеДоговоров Цикл
			
			ДанныеДетальныхЗаписей = СтрокаДереваПервогоУровня.Строки[0];
			Если ДанныеДетальныхЗаписей.Строки.Количество() > 0 Тогда
				ДанныеДоговора = ДанныеДетальныхЗаписей.Строки[0];
			Иначе
				ДанныеДоговора = ДанныеДетальныхЗаписей;
			КонецЕсли;
			
			//Для печати комплектов
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеДоговора.РаботаСотрудник,"Ссылка");
				Если КомплектПечатиПоСсылке = Неопределено Тогда
					КомплектПечатиПоСсылке = КомплектыПечати[0];
				КонецЕсли;
				Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
					Продолжить
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПервыйОбъект Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйОбъект      = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			////// Заполнение данных объекта
			
			ДанныеОбъекта = Новый Структура;
			
			// Длительность основного отпуска
			ПараметрыПредметаИсчисления = ", , , , , , , , 0";
			ДлительностьОсновногоОтпуска = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска), ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска, 0);
			ДлительностьОсновногоОтпускаПрописью = "";
			ДлительностьОсновногоОтпускаПрописью = НРег(ЧислоПрописью(ОКР(ДлительностьОсновногоОтпуска), "Л=ru_RU;НП=Ложь;НД=Ложь", ПараметрыПредметаИсчисления));
			
			// Сумма оклада (тарифная ставка)		
			ФормаОплатыТруда = ?(СтрНайти(ДанныеДоговора.РаботаОплатаТрудаНачисление.ФормулаРасчета,"ТарифнаяСтавкаЧасовая")>0,"почасовая оплата труда из расчета","должностной оклад в размере");
			ОкладСумма = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя), ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя , ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаРазмер), ДанныеДоговора.РаботаОплатаТрудаРазмер, 0));
			ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОкладСумма, ВалютаСсылка);
			
			ТекущиеДанныеФизЛицаСотрудника = ПолучитьСтрокуТаблицы(ДанныеФизЛицСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДополнитьДанныеОбъектаИнформациейОбОрганизации(ДанныеОбъекта, Неопределено, ДанныеДоговора.РаботаДатаПриема, ТекущиеДанныеФизЛицаСотрудника);
			
			КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан", ДанныеДоговора.РаботаДатаПриема);
			ТекущиеКадровыеДанныеФизическихЛиц = ПолучитьСтрокуТаблицы(КадровыеДанныеФизическихЛиц, Новый Структура("ФизическоеЛицо", ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо));
			
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ДанныеДоговора.РаботаСотрудник, "КлассУсловийТруда");
			ТекущиеКадровыеДанныеСотрудников = ПолучитьСтрокуТаблицы(КадровыеДанныеСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДанныеОбъекта.Вставить("ДоговорНомер",                         ДанныеДоговора.РаботаТрудовойДоговорНомерНаПечать);
			ДанныеОбъекта.Вставить("ДоговорДата",                          СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаТрудовойДоговорДатаОформления), ДанныеДоговора.РаботаТрудовойДоговорДатаОформления, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ДатаПриема",                           СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаДатаПриема), ДанныеДоговора.РаботаДатаПриема, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ИспытательныйСрокМесяцев",             СтрокаДоговора(ДанныеДоговора.РаботаТрудовойДоговорДлительностьИспытательногоСрока,, Истина, ));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпускаПрописью", СтрокаДоговора(ПервоеСловоСЗаглавной(ДлительностьОсновногоОтпускаПрописью)));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпуска",         СтрокаДоговора(ДлительностьОсновногоОтпуска,, Истина, ));
			ДанныеОбъекта.Вставить("ОкладСумма",                           СтрокаДоговора(ФормированиеПечатныхФорм.ФорматСумм(ОкладСумма, ВалютаСсылка, "0")));
			ДанныеОбъекта.Вставить("ОкладСуммаПрописью",                   СтрокаДоговора(ОкладСуммаПрописью));
			ДанныеОбъекта.Вставить("ОрганизацияГородФактическогоАдреса",   СтрокаДоговора(ДанныеДоговора.РаботаОрганизацияГородФактическогоАдреса));
			ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как типовая функция возвращает Подразделение в виде справочника ссылки
			ДанныеОбъекта.Вставить("КлассУсловийТруда",                    СтрокаДоговора(ТекущиеКадровыеДанныеСотрудников.КлассУсловийТруда));
			
			ДанныеОбъекта.Вставить("Сотрудник",                  ДанныеДоговора.РаботаСотрудник);
			ДанныеОбъекта.Вставить("СотрудникФИОПолные",         СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеФИОФамилияИмяОтчество));
			ДанныеОбъекта.Вставить("СотрудникФИОИнициалы",       СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо)));
			ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование, Истина));
			ДанныеОбъекта.Вставить("СотрудникСНИЛС",             СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеСтраховойНомерПФР)); // СНИЛС - это "Страховой номер ПФР"
			ДанныеОбъекта.Вставить("СотрудникИменуемое",         ?(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский, "именуемая", "именуемый"));
			ДанныеОбъекта.Вставить("СотрудникДатаРождения",      СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоДатаРождения));
			ДанныеОбъекта.Вставить("СотрудникПаспортСерия",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументСерия));
			ДанныеОбъекта.Вставить("СотрудникПаспортНомер",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументНомер));
			ДанныеОбъекта.Вставить("СотрудникПаспортКемВыдан",   СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКемВыдан));
			ДанныеОбъекта.Вставить("СотрудникПаспортДатаВыдачи", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументДатаВыдачи));
			ДанныеОбъекта.Вставить("СотрудникАдресПоПрописке",   СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.АдресПоПрописке));
			ДанныеОбъекта.Вставить("СотрудникИНН",               СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоИНН));
			ДанныеОбъекта.Вставить("ТекущаяДата",   			 СтрокаДоговора(ТекущаяДатаСеанса()));
			ДанныеОбъекта.Вставить("ФормаОплатыТруда",   		 СтрокаДоговора(ФормаОплатыТруда));
			
			
			////// Заполнение данных объекта
			
			////// Вывод областей макета
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");			
			ОбластьТекст     = Макет.ПолучитьОбласть("Текст");	  		
			ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
			
			// Вывод данных в заголовок договора
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			// Вывод данных в текст договора
			// Выведем "ОбластьТекст" в табличный документ фрагментами, с целью более полного заполнения формата страницы
			ОбластьТекст.Параметры.Заполнить(ДанныеОбъекта);
			
			ОбластьТекст.Параметры.РабочаяНеделя = "пятидневная рабочая неделя с восьмичасовым рабочим днем.";
			Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" И ДанныеДоговора.РаботаДатаПриема >= Дата("20191101") Тогда
				//ОбластьТекст.Параметры.ОрганизацияАдресФактический = "429509, Чувашская Республика, сельское поселение Атлашевское, д.Кодеркасы, территория тепличный комплекс Новочебоксарский";	  						
				
				Если ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский Тогда
					ОбластьТекст.Параметры.РабочаяНеделя = "пятидневная 36-часовая рабочая неделя.";
				Иначе
					ОбластьТекст.Параметры.РабочаяНеделя = "пятидневная рабочая неделя с восьмичасовым рабочим днем.";	
				КонецЕсли;		
			КонецЕсли;
			
			//Изменения с 31.01.2020:
			//1. Изменения в п.1.4
			//2. Изменения в п.3.2
			Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" И ДанныеДоговора.РаботаДатаПриема >= Дата("20200131") Тогда
				ОбластьТекст.Параметры.УсловияТруда = "Условия труда на рабочем месте Работника относятся к допустимым (2-й класс), выполняемая Работником по настоящему договору работа не относится к работе с тяжелыми, вредными и (или) опасными условиями труда. Рабочее место соответствует государственным требованиям охраны труда.";
				ОбластьТекст.Параметры.ВремяНачалоОкончанияРабот = "3.2. Время начала и окончания работы, время перерыва на обед, а также выходные дни  устанавливаются Правилами внутреннего трудового распорядка.";
			Иначе
				ОбластьТекст.Параметры.УсловияТруда = "На момент заключения трудового договора рабочее место не оценено. Оценка будет произведена в течение 12 месяцев, после чего условия труда будут доведены до Работника.";
				ОбластьТекст.Параметры.ВремяНачалоОкончанияРабот = "3.2. Время начала и окончания работы, время перерыва на обед устанавливаются Правилами внутреннего трудового распорядка.";
			КонецЕсли;
			
			//Изменения с 26.05.2020:
			//1. Изменения в п.4.2
			Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" И ДанныеДоговора.РаботаДатаПриема >= Дата("20200501") Тогда
				ОбластьТекст.Параметры.СрокВыплатыАванса = "29";
				ОбластьТекст.Параметры.СрокВыплатыЗарплаты = "14";
			Иначе
				ОбластьТекст.Параметры.СрокВыплатыАванса = "25";
				ОбластьТекст.Параметры.СрокВыплатыЗарплаты = "10";
			КонецЕсли;
			
			
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьТекст, ТабличныйДокумент);
			
			// Вывод данных в подписи договора
			// Выведем "ОбластьПодписи" в табличный документ по-строчно, с целью более полного заполнения формата страницы
			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);
			Если ИмяМакета = "ПФ_MXL_ТрудовойДоговор" или ИмяМакета = "ПФ_MXL_ТрудовойДоговор_Общий" Тогда
				
				// Для макета "ТрудовойДоговор" подписи всегда должны выводиться на отдельной странице			
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
				
			Иначе
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			КонецЕсли;
			
			////// Вывод областей макета
			
			// Выведем нужное количество экземпляров (при печати комплектов)
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
				ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
				Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьКопирования);
				КонецЦикла;
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДоговора.РаботаСотрудник);
			
		КонецЦикла;
		
		// На всякий случай добавим еще сюда
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция СформироватьПечатнуюФормуТрудовойДоговорОбщийТКП(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати, Макет) //18.05.21 АМ
		
		УстановитьПривилегированныйРежим(Истина);
		
		ВалютаСсылка = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ИмяПараметровПечати = СтрЗаменить(Макет, "ПФ_MXL_", "ПАРАМЕТРЫ_ПЕЧАТИ_");
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПолеСверху = 5;
		ТабличныйДокумент.ПолеСнизу = 5;
		ТабличныйДокумент.ПолеСлева = 10;
		ТабличныйДокумент.ПолеСправа = 5;
		ТабличныйДокумент.КоличествоЭкземпляров = 2;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 4;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 4;
		
		ИмяМакета = Макет;
		
		Макет = ПолучитьМакет(Макет);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТрудовойДоговор(МассивОбъектов, Истина);
		
		ДанныеДоговоров = ДанныеДляПечати.ДанныеДоговоров;
		
		ДанныеФизЛицСотрудников = ДанныеДляПечати.ДанныеФизическихЛицСотрудников;
		
		ПервыйОбъект = Истина;
		Для каждого СтрокаДереваПервогоУровня Из ДанныеДоговоров Цикл
			
			ДанныеДетальныхЗаписей = СтрокаДереваПервогоУровня.Строки[0];
			Если ДанныеДетальныхЗаписей.Строки.Количество() > 0 Тогда
				ДанныеДоговора = ДанныеДетальныхЗаписей.Строки[0];
			Иначе
				ДанныеДоговора = ДанныеДетальныхЗаписей;
			КонецЕсли;
			
			//Для печати комплектов
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеДоговора.РаботаСотрудник,"Ссылка");
				Если КомплектПечатиПоСсылке = Неопределено Тогда
					КомплектПечатиПоСсылке = КомплектыПечати[0];
				КонецЕсли;
				Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
					Продолжить
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПервыйОбъект Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйОбъект      = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			////// Заполнение данных объекта
			
			ДанныеОбъекта = Новый Структура;
			
			// Длительность основного отпуска
			ПараметрыПредметаИсчисления = ", , , , , , , , 0";
			ДлительностьОсновногоОтпуска = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска), ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска, 0);
			ДлительностьОсновногоОтпускаПрописью = "";
			ДлительностьОсновногоОтпускаПрописью = НРег(ЧислоПрописью(ОКР(ДлительностьОсновногоОтпуска), "Л=ru_RU;НП=Ложь;НД=Ложь", ПараметрыПредметаИсчисления));
			
			// Сумма оклада (тарифная ставка)		
			ФормаОплатыТруда = ?(СтрНайти(ДанныеДоговора.РаботаОплатаТрудаНачисление.ФормулаРасчета,"ТарифнаяСтавкаЧасовая")>0,"почасовая оплата труда из расчета","месячный должностной оклад в размере");
			ОкладСумма = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя), ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя , ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаРазмер), ДанныеДоговора.РаботаОплатаТрудаРазмер, 0));
			ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОкладСумма, ВалютаСсылка);
			
			ТекущиеДанныеФизЛицаСотрудника = ПолучитьСтрокуТаблицы(ДанныеФизЛицСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДополнитьДанныеОбъектаИнформациейОбОрганизации(ДанныеОбъекта, Неопределено, ДанныеДоговора.РаботаДатаПриема, ТекущиеДанныеФизЛицаСотрудника);
			
			КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан", ДанныеДоговора.РаботаДатаПриема);
			ТекущиеКадровыеДанныеФизическихЛиц = ПолучитьСтрокуТаблицы(КадровыеДанныеФизическихЛиц, Новый Структура("ФизическоеЛицо", ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо));
			
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ДанныеДоговора.РаботаСотрудник, "КлассУсловийТруда");
			ТекущиеКадровыеДанныеСотрудников = ПолучитьСтрокуТаблицы(КадровыеДанныеСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДанныеОбъекта.Вставить("ДоговорНомер",                         ДанныеДоговора.РаботаТрудовойДоговорНомерНаПечать);
			ДанныеОбъекта.Вставить("ДоговорДата",                          СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаТрудовойДоговорДатаОформления), ДанныеДоговора.РаботаТрудовойДоговорДатаОформления, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ДатаПриема",                           СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаДатаПриема), ДанныеДоговора.РаботаДатаПриема, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ИспытательныйСрокМесяцев",             СтрокаДоговора(ДанныеДоговора.РаботаТрудовойДоговорДлительностьИспытательногоСрока,, Истина, ));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпускаПрописью", СтрокаДоговора(ПервоеСловоСЗаглавной(ДлительностьОсновногоОтпускаПрописью)));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпуска",         СтрокаДоговора(ДлительностьОсновногоОтпуска,, Истина, ));
			ДанныеОбъекта.Вставить("ОкладСумма",                           СтрокаДоговора(ФормированиеПечатныхФорм.ФорматСумм(ОкладСумма, ВалютаСсылка, "0")));
			ДанныеОбъекта.Вставить("ОкладСуммаПрописью",                   СтрокаДоговора(ОкладСуммаПрописью));
			ДанныеОбъекта.Вставить("ОрганизацияГородФактическогоАдреса",   СтрокаДоговора(ДанныеДоговора.РаботаОрганизацияГородФактическогоАдреса));
			ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как типовая функция возвращает Подразделение в виде справочника ссылки
			ДанныеОбъекта.Вставить("КлассУсловийТруда",                    СтрокаДоговора(ТекущиеКадровыеДанныеСотрудников.КлассУсловийТруда));
			
			ДанныеОбъекта.Вставить("Сотрудник",                  ДанныеДоговора.РаботаСотрудник);
			ДанныеОбъекта.Вставить("СотрудникФИОПолные",         СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеФИОФамилияИмяОтчество));
			ДанныеОбъекта.Вставить("СотрудникФИОИнициалы",       СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо)));
			ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование, Истина));
			ДанныеОбъекта.Вставить("СотрудникСНИЛС",             СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеСтраховойНомерПФР)); // СНИЛС - это "Страховой номер ПФР"
			ДанныеОбъекта.Вставить("СотрудникИменуемое",         ?(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский, "именуемая", "именуемый"));
			ДанныеОбъекта.Вставить("СотрудникДатаРождения",      СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоДатаРождения));
			ДанныеОбъекта.Вставить("СотрудникПаспортСерия",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументСерия));
			ДанныеОбъекта.Вставить("СотрудникПаспортНомер",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументНомер));
			ДанныеОбъекта.Вставить("СотрудникПаспортКемВыдан",   СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКемВыдан));
			ДанныеОбъекта.Вставить("СотрудникПаспортДатаВыдачи", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументДатаВыдачи));
			ДанныеОбъекта.Вставить("СотрудникАдресПоПрописке",   СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.АдресПоПрописке));
			ДанныеОбъекта.Вставить("СотрудникИНН",               СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоИНН));
			ДанныеОбъекта.Вставить("ТекущаяДата",   			 СтрокаДоговора(ТекущаяДатаСеанса()));
			ДанныеОбъекта.Вставить("ФормаОплатыТруда",   		 СтрокаДоговора(ФормаОплатыТруда));
			ДанныеОбъекта.Вставить("Должность",                  ДанныеДоговора.РаботаДолжность);
			
			////// Заполнение данных объекта
			
			//Запрос
			
			Запрос = Новый Запрос;
			
			//ТокмаковАМ
			Если ИмяМакета = "ПФ_MXL_ТрудовойДоговор_Общий_ТКП" Тогда 
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	КлассыУсловийТрудаПоДолжностямСрезПоследних.КлассУсловийТруда КАК КлассУсловийТруда,
				//ТокмаковАМ                                                                                
				//|	КлассыУсловийТрудаПоДолжностямСрезПоследних.ДатаРегистрацииИзменений КАК ДатаРегистрацииИзменений 
				|	ИсторияИспользованияШтатногоРасписания.ПроцентНадбавкиЗаВредность КАК ПроцентНадбавкиЗаВредность,
				|	ИсторияИспользованияШтатногоРасписания.Дата КАК Дата,
				//добавлено
				|	КлассыУсловийТрудаПоДолжностямСрезПоследних.Период КАК ДатаРегистрацииИзменений
				//добавлено ТокмаковАМ
				|ИЗ
				|	РегистрСведений.КлассыУсловийТрудаПоДолжностям.СрезПоследних(, Должность = &Должность) КАК КлассыУсловийТрудаПоДолжностямСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК ИсторияИспользованияШтатногоРасписания
				|		ПО КлассыУсловийТрудаПоДолжностямСрезПоследних.Должность = ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания.Должность
				|
				|УПОРЯДОЧИТЬ ПО
				|	Дата УБЫВ";
			Иначе
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	КлассыУсловийТрудаПоДолжностямСрезПоследних.КлассУсловийТруда КАК КлассУсловийТруда,                                                                               
				|	КлассыУсловийТрудаПоДолжностямСрезПоследних.ДатаРегистрацииИзменений КАК ДатаРегистрацииИзменений 
				|	ИсторияИспользованияШтатногоРасписания.ПроцентНадбавкиЗаВредность КАК ПроцентНадбавкиЗаВредность,
				|	ИсторияИспользованияШтатногоРасписания.Дата КАК Дата,
				|ИЗ
				|	РегистрСведений.КлассыУсловийТрудаПоДолжностям.СрезПоследних(, Должность = &Должность) КАК КлассыУсловийТрудаПоДолжностямСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК ИсторияИспользованияШтатногоРасписания
				|		ПО КлассыУсловийТрудаПоДолжностямСрезПоследних.Должность = ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания.Должность
				|
				|УПОРЯДОЧИТЬ ПО
				|	Дата УБЫВ";
			КонецЕсли;
			//ТокмаковАМ
			
			
			Запрос.УстановитьПараметр("Должность", ДанныеОбъекта.Должность);	
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			
			Запрос2 = Новый Запрос;
			Запрос2.Текст = 
			"ВЫБРАТЬ
			|	ПоложенныеВидыЕжегодныхОтпусковСрезПервых.КоличествоДнейВГод КАК КоличествоДнейВГод,
			|	ГрафикРаботыСотрудниковСрезПервых.ГрафикРаботы.СуммированныйУчетРабочегоВремени КАК ГрафикРаботыСуммированныйУчетРабочегоВремени,
			|	ГрафикРаботыСотрудниковСрезПервых.ГрафикРаботы КАК ГрафикРаботы
			|ИЗ
			|	РегистрСведений.ГрафикРаботыСотрудников.СрезПервых(, Сотрудник = &Сотрудник) КАК ГрафикРаботыСотрудниковСрезПервых
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоложенныеВидыЕжегодныхОтпусков.СрезПервых(
			|				,
			|				Сотрудник = &Сотрудник
			|					И ВидЕжегодногоОтпуска = ЗНАЧЕНИЕ(Справочник.ВидыОтпусков.ОтпускЗаВредность)) КАК ПоложенныеВидыЕжегодныхОтпусковСрезПервых
			|		ПО (ПоложенныеВидыЕжегодныхОтпусковСрезПервых.Сотрудник = ГрафикРаботыСотрудниковСрезПервых.Сотрудник)";
			
			Запрос2.УстановитьПараметр("Сотрудник", ДанныеОбъекта.Сотрудник);
			РезультатЗапроса2 = Запрос2.Выполнить().Выгрузить(); 			
			
			////// Вывод областей макета
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");			
			ОбластьТекст     = Макет.ПолучитьОбласть("Текст");	  		
			ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
			
			// Вывод данных в заголовок договора
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			// Вывод данных в текст договора
			// Выведем "ОбластьТекст" в табличный документ фрагментами, с целью более полного заполнения формата страницы
			ОбластьТекст.Параметры.Заполнить(ДанныеОбъекта);
			Если РезультатЗапроса.Количество() < 1 Тогда
				ОбластьТекст.Параметры.УсловияТруда = "На момент заключения трудового договора рабочее место не оценено. Оценка будет произведена в течение 12 месяцев, после чего условия труда будут доведены до Работника.";
			Иначе
				Для каждого Строка Из РезультатЗапроса Цикл
					Если Строка.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1 Тогда
						ОбластьТекст.Параметры.УсловияТруда = "Условия труда на рабочем месте Работника по степени вредности и (или) опасности являются вредными условиями труда (класс 3, подкласс 3.1), что подтверждается отчетом о проведенной специальной оценке условий труда от " 
						+ Формат(Строка.ДатаРегистрацииИзменений,"ДЛФ=DD");
						Попытка
							ЧислоПрописью = ЧислоПрописью(РезультатЗапроса2[0].КоличествоДнейВГод);
							ОбластьТекст.Параметры.ДопДниОтпуска = "В связи   с работой   во вредных условиях   труда Работнику устанавливается ежегодный дополнительный оплачиваемый отпуск продолжительностью " + РезультатЗапроса2[0].КоличествоДнейВГод + "(" + Лев(ЧислоПрописью,СтрДлина(ЧислоПрописью) -5) + ") календарных дней.";
						Исключение	
						КонецПопытки;
						Если Строка.ПроцентНадбавкиЗаВредность > 0 Тогда
							ОбластьТекст.Параметры.Пункт4_6 = "4.6. В связи с работой во вредных и (или) опасных условиях труда Работнику устанавливается доплата в размере " 
							+ Строка.ПроцентНадбавкиЗаВредность + "% за время фактической занятости работников на этих работах."
						КонецЕсли;
					ИначеЕсли Строка.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2 Тогда
						ОбластьТекст.Параметры.УсловияТруда = "Условия труда на рабочем месте Работника по степени вредности и (или) опасности являются вредными условиями труда (класс 3, подкласс 3.2), что подтверждается отчетом о проведенной специальной оценке условий труда от " 
						+ Формат(Строка.ДатаРегистрацииИзменений,"ДЛФ=DD");
						Попытка
							ЧислоПрописью = ЧислоПрописью(РезультатЗапроса2[0].КоличествоДнейВГод);
							ОбластьТекст.Параметры.ДопДниОтпуска = "В связи   с работой   во вредных условиях   труда Работнику устанавливается ежегодный дополнительный оплачиваемый отпуск продолжительностью " + РезультатЗапроса2[0].КоличествоДнейВГод + "(" + Лев(ЧислоПрописью,СтрДлина(ЧислоПрописью) -5) + ") календарных дней.";
						Исключение	
						КонецПопытки;
						Если Строка.ПроцентНадбавкиЗаВредность > 0 Тогда
							ОбластьТекст.Параметры.Пункт4_6 = "4.6. В связи с работой во вредных и (или) опасных условиях труда Работнику устанавливается доплата в размере " 
							+ Строка.ПроцентНадбавкиЗаВредность + "% за время фактической занятости работников на этих работах."
						КонецЕсли
					ИначеЕсли Строка.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3 Тогда
						ОбластьТекст.Параметры.УсловияТруда = "Условия труда на рабочем месте Работника по степени вредности и (или) опасности являются вредными условиями труда (класс 3, подкласс 3.3), что подтверждается отчетом о проведенной специальной оценке условий труда от " 
						+ Формат(Строка.ДатаРегистрацииИзменений,"ДЛФ=DD");
					ИначеЕсли Строка.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4 Тогда
						ОбластьТекст.Параметры.УсловияТруда = "Условия труда на рабочем месте Работника по степени вредности и (или) опасности являются вредными условиями труда (класс 3, подкласс 3.4), что подтверждается отчетом о проведенной специальной оценке условий труда от " 
						+ Формат(Строка.ДатаРегистрацииИзменений,"ДЛФ=DD");
					ИначеЕсли Строка.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый Тогда
						ОбластьТекст.Параметры.УсловияТруда = "Условия труда на рабочем месте Работника по степени вредности и (или) опасности являются допустимыми (2 класс), что подтверждается отчетом о специальной оценке условий труда от " 
						+ Формат(Строка.ДатаРегистрацииИзменений,"ДЛФ=DD");
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ОбластьТекст.Параметры.РабочаяНеделя = "пятидневная рабочая неделя с восьмичасовым рабочим днем.";
			
			//++ ШишковАС 12.01.2022 задача:e1c://server/Erpn1/edo_main#e1cib/data/Задача.ЗадачаИсполнителя?ref=82f97c1cf153e25c11ec6196009e522e
			Если ДанныеОбъекта.ОкладСумма = "0 руб." Тогда 
				ОбластьТекст.Параметры.Об410 = "Работнику устанавливается сдельно-премиальная система оплаты труда. Сдельные расценки, нормы выработки и размер премии устанавливаются в соответствии с действующим Положением об оплате труда ООО ТК «Пермский».";
				ОбластьТекст.Параметры.Об411 = "";
				ОбластьТекст.Параметры.Об412 = "";
				ОбластьТекст.Параметры.ФормаОплатыТруда = "";
				ОбластьТекст.Параметры.ОкладСумма = "";
				ОбластьТекст.Параметры.ОкладСуммаПрописью = "";
			Иначе
				ОбластьТекст.Параметры.Об410 = "";
				ОбластьТекст.Параметры.Об411 = "Работнику устанавливается";
				ОбластьТекст.Параметры.Об412 = "и премия в соответствии с действующим Положением об оплате труда ООО ТК «Пермский».";
				ОбластьТекст.Параметры.ФормаОплатыТруда = ДанныеОбъекта.ФормаОплатыТруда;
				ОбластьТекст.Параметры.ОкладСумма = ДанныеОбъекта.ОкладСумма;
				ОбластьТекст.Параметры.ОкладСуммаПрописью = "(" + ДанныеОбъекта.ОкладСуммаПрописью + ")";		
			КонецЕсли;
			//++Шишков АС 12.01.2022 задача:e1c://server/Erpn1/edo_main#e1cib/data/Задача.ЗадачаИсполнителя?ref=82f97c1cf153e25c11ec6196009e522e
			
		
			Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" И ДанныеДоговора.РаботаДатаПриема >= Дата("20191101") Тогда
				//ОбластьТекст.Параметры.ОрганизацияАдресФактический = "429509, Чувашская Республика, сельское поселение Атлашевское, д.Кодеркасы, территория тепличный комплекс Новочебоксарский";	  						
				
				Если ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский Тогда
					ОбластьТекст.Параметры.РабочаяНеделя = "пятидневная 36-часовая рабочая неделя.";
				Иначе
					ОбластьТекст.Параметры.РабочаяНеделя = "пятидневная рабочая неделя с восьмичасовым рабочим днем.";	
				КонецЕсли;		
			КонецЕсли;
			
			Если РезультатЗапроса2[0].ГрафикРаботыСуммированныйУчетРабочегоВремени = Истина Тогда
				ОбластьТекст.Параметры.РН = "Рабочее время Работника регламентируется графиком работы " + РезультатЗапроса2[0].ГрафикРаботы + ". "; 
				ОбластьТекст.Параметры.РабочаяНеделя = "суммированный учет рабочего времени (учетный период 1 год). Продолжительность рабочего времени за учетный период не должна превышать нормального числа рабочих часов (норму рабочего времени за 1 год, установленную для соответствующей категории работников).";
			КонецЕсли;
			
			
			////Изменения с 31.01.2020:
			////1. Изменения в п.1.4
			////2. Изменения в п.3.2
			Если ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН = "2130184747" И ДанныеДоговора.РаботаДатаПриема >= Дата("20200131") Тогда
				//ОбластьТекст.Параметры.УсловияТруда = "Условия труда на рабочем месте Работника относятся к допустимым (2-й класс), выполняемая Работником по настоящему договору работа не относится к работе с тяжелыми, вредными и (или) опасными условиями труда. Рабочее место соответствует государственным требованиям охраны труда.";
				ОбластьТекст.Параметры.ВремяНачалоОкончанияРабот = "3.2. Время начала и окончания работы, время перерыва на обед, а также выходные дни  устанавливаются Правилами внутреннего трудового распорядка.";
			Иначе
				//ОбластьТекст.Параметры.УсловияТруда = "На момент заключения трудового договора рабочее место не оценено. Оценка будет произведена в течение 12 месяцев, после чего условия труда будут доведены до Работника.";
				ОбластьТекст.Параметры.ВремяНачалоОкончанияРабот = "3.2. Время начала и окончания работы, время перерыва на обед устанавливаются Правилами внутреннего трудового распорядка.";
			КонецЕсли;
			
			ОбластьТекст.Параметры.СрокВыплатыАванса = "29";
			ОбластьТекст.Параметры.СрокВыплатыЗарплаты = "14";
			
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьТекст, ТабличныйДокумент);
			
			// Вывод данных в подписи договора
			// Выведем "ОбластьПодписи" в табличный документ по-строчно, с целью более полного заполнения формата страницы
			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);
			//Если ИмяМакета = "ПФ_MXL_ТрудовойДоговор" или ИмяМакета = "ПФ_MXL_ТрудовойДоговор_Общий_ТКП" Тогда
			//	
			//	// Для макета "ТрудовойДоговор" подписи всегда должны выводиться на отдельной странице			
			//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			//	ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			//	
			//Иначе
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			//КонецЕсли;
			
			////// Вывод областей макета
			
			// Выведем нужное количество экземпляров (при печати комплектов)
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
				ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
				Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьКопирования);
				КонецЦикла;
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДоговора.РаботаСотрудник);
			
		КонецЦикла;
		
		// На всякий случай добавим еще сюда
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы]";
		ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
		
		
		Возврат ТабличныйДокумент;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция СформироватьПечатнуюФормуТрудовойДоговорДоп(МассивОбъектов, ОбъектыПечати, КомплектыПечати, ПараметрыПечати, Макет) //9428 ASTRA ГайнаДИ AddOn Begin
		
		УстановитьПривилегированныйРежим(Истина);
		
		ВалютаСсылка = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ИмяПараметровПечати = СтрЗаменить(Макет, "ПФ_MXL_", "ПАРАМЕТРЫ_ПЕЧАТИ_");
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПолеСверху = 5;
		ТабличныйДокумент.ПолеСнизу = 5;
		ТабличныйДокумент.ПолеСлева = 10;
		ТабличныйДокумент.ПолеСправа = 5;
		ТабличныйДокумент.КоличествоЭкземпляров = 2;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.РазмерКолонтитулаСверху = 4;
		ТабличныйДокумент.РазмерКолонтитулаСнизу = 4;
		
		ИмяМакета = Макет;
		
		Макет = ПолучитьМакет(Макет);
		
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТрудовойДоговор(МассивОбъектов);
		
		ДанныеДоговоров = ДанныеДляПечати.ДанныеДоговоров;
		
		ДанныеФизЛицСотрудников = ДанныеДляПечати.ДанныеФизическихЛицСотрудников;
		
		ПервыйОбъект = Истина;
		Для каждого СтрокаДереваПервогоУровня Из ДанныеДоговоров Цикл
			
			ДанныеДетальныхЗаписей = СтрокаДереваПервогоУровня.Строки[0];
			Если ДанныеДетальныхЗаписей.Строки.Количество() > 0 Тогда
				ДанныеДоговора = ДанныеДетальныхЗаписей.Строки[0];
			Иначе
				ДанныеДоговора = ДанныеДетальныхЗаписей;
			КонецЕсли;
			
			//Для печати комплектов
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати.Найти(ДанныеДоговора.РаботаСотрудник,"Ссылка");
				Если КомплектПечатиПоСсылке = Неопределено Тогда
					КомплектПечатиПоСсылке = КомплектыПечати[0];
				КонецЕсли;
				Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
					Продолжить
				КонецЕсли;
			КонецЕсли;
			
			Если Не ПервыйОбъект Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйОбъект      = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			////// Заполнение данных объекта
			
			ДанныеОбъекта = Новый Структура;
			
			// Длительность основного отпуска
			ПараметрыПредметаИсчисления = ", , , , , , , , 0";
			ДлительностьОсновногоОтпуска = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска), ДанныеДоговора.РаботаПраваНаОтпускКоличествоДнейОбщегоОтпуска, 0);
			ДлительностьОсновногоОтпускаПрописью = "";
			ДлительностьОсновногоОтпускаПрописью = НРег(ЧислоПрописью(ОКР(ДлительностьОсновногоОтпуска), "Л=ru_RU;НП=Ложь;НД=Ложь", ПараметрыПредметаИсчисления));
			
			// Сумма оклада (тарифная ставка)		
			ФормаОплатыТруда = ?(СтрНайти(ДанныеДоговора.РаботаОплатаТрудаНачисление.ФормулаРасчета,"ТарифнаяСтавкаЧасовая")>0,"почасовая оплата труда из расчета","должностной оклад в размере");
			ОкладСумма = ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя), ДанныеДоговора.РаботаОплатаТрудаЗначениеОсновногоПоказателя , ?(ЗначениеЗаполнено(ДанныеДоговора.РаботаОплатаТрудаРазмер), ДанныеДоговора.РаботаОплатаТрудаРазмер, 0));
			ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОкладСумма, ВалютаСсылка);
			
			ТекущиеДанныеФизЛицаСотрудника = ПолучитьСтрокуТаблицы(ДанныеФизЛицСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			
			ДополнитьДанныеОбъектаИнформациейОбОрганизации(ДанныеОбъекта, Неопределено, ДанныеДоговора.РаботаДатаПриема, ТекущиеДанныеФизЛицаСотрудника);
			// ++ бит_п_Новоселов А.И. 06.02.2025 #0000027509
			//КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан", ДанныеДоговора.РаботаДатаПриема);
			КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан,ФИО", ТекущаяДата());
			// -- бит_п_Новоселов А.И. 06.02.2025
			
			ТекущиеКадровыеДанныеФизическихЛиц = ПолучитьСтрокуТаблицы(КадровыеДанныеФизическихЛиц, Новый Структура("ФизическоеЛицо", ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо));
			
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ДанныеДоговора.РаботаСотрудник, "КлассУсловийТруда");
			ТекущиеКадровыеДанныеСотрудников = ПолучитьСтрокуТаблицы(КадровыеДанныеСотрудников, Новый Структура("Сотрудник", ДанныеДоговора.РаботаСотрудник));
			
			ДанныеОбъекта.Вставить("ДоговорНомер",                         ДанныеДоговора.РаботаТрудовойДоговорНомерНаПечать);
			ДанныеОбъекта.Вставить("ДоговорДата",                          СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаТрудовойДоговорДатаОформления), ДанныеДоговора.РаботаТрудовойДоговорДатаОформления, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ДатаПриема",                           СтрокаДоговора(?(ЗначениеЗаполнено(ДанныеДоговора.РаботаДатаПриема), ДанныеДоговора.РаботаДатаПриема, Дата(1,1,1))));
			ДанныеОбъекта.Вставить("ИспытательныйСрокМесяцев",             СтрокаДоговора(ДанныеДоговора.РаботаТрудовойДоговорДлительностьИспытательногоСрока,, Истина, ));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпускаПрописью", СтрокаДоговора(ПервоеСловоСЗаглавной(ДлительностьОсновногоОтпускаПрописью)));
			ДанныеОбъекта.Вставить("ДлительностьОсновногоОтпуска",         СтрокаДоговора(ДлительностьОсновногоОтпуска,, Истина, ));
			ДанныеОбъекта.Вставить("ОкладСумма",                           СтрокаДоговора(ФормированиеПечатныхФорм.ФорматСумм(ОкладСумма, ВалютаСсылка, "0")));
			ДанныеОбъекта.Вставить("ОкладСуммаПрописью",                   СтрокаДоговора(ОкладСуммаПрописью));
			ДанныеОбъекта.Вставить("ОрганизацияГородФактическогоАдреса",   СтрокаДоговора(ДанныеДоговора.РаботаОрганизацияГородФактическогоАдреса));
			ДанныеОбъекта.Вставить("Подразделение",                        СтрокаДоговора(ДанныеДоговора.РаботаПодразделениеНаПечать.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как типовая функция возвращает Подразделение в виде справочника ссылки
			ДанныеОбъекта.Вставить("КлассУсловийТруда",                    СтрокаДоговора(ТекущиеКадровыеДанныеСотрудников.КлассУсловийТруда));
			
			ДанныеОбъекта.Вставить("Сотрудник",                  ДанныеДоговора.РаботаСотрудник);
			// ++ бит_п_Новоселов А.И. 06.02.2025 #0000027509
			//ДанныеОбъекта.Вставить("СотрудникФИОПолные",         СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеФИОФамилияИмяОтчество));  
			ДанныеОбъекта.Вставить("СотрудникФИОПолные",         СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ФИО));
			// -- бит_п_Новоселов А.И. 06.02.2025
			ДанныеОбъекта.Вставить("СотрудникФИОИнициалы",       СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицо)));
			ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование)); // Ничего не остается, кроме как обратиться через точку к наименованию, так как у данного справочника ссылка в строку не преобразовуется, а типовая функция возвращает Должность в виде справочника ссылки
			ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДанныеДоговора.РаботаДолжность.Наименование, Истина)); 
			//ТокмаковАМ
			ТекущаяДолжностьСотрудника = ПолучитьДолжностьСотрудника(ДанныеДоговора.СсылкаНаОбъект);
			//ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег", НРег(ТекущаяДолжностьСотрудника));
			//ТокмаковАМ
			ДанныеОбъекта.Вставить("СотрудникСНИЛС",             СтрокаДоговора(ДанныеДоговора.ЛичныеДанныеСтраховойНомерПФР)); // СНИЛС - это "Страховой номер ПФР"
			ДанныеОбъекта.Вставить("СотрудникИменуемое",         ?(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский, "именуемая", "именуемый"));
			ДанныеОбъекта.Вставить("СотрудникДатаРождения",      СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоДатаРождения));
			ДанныеОбъекта.Вставить("СотрудникПаспортСерия",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументСерия));
			ДанныеОбъекта.Вставить("СотрудникПаспортНомер",      СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументНомер));
			ДанныеОбъекта.Вставить("СотрудникПаспортКемВыдан",   СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументКемВыдан));
			ДанныеОбъекта.Вставить("СотрудникПаспортДатаВыдачи", СтрокаДоговора(ТекущиеКадровыеДанныеФизическихЛиц.ДокументДатаВыдачи));
			ДанныеОбъекта.Вставить("СотрудникАдресПоПрописке",   СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.АдресПоПрописке));
			ДанныеОбъекта.Вставить("СотрудникИНН",               СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоИНН));
			ДанныеОбъекта.Вставить("ТекущаяДата",   			 СтрокаДоговора(ТекущаяДатаСеанса()));
			ДанныеОбъекта.Вставить("ФормаОплатыТруда",   		 СтрокаДоговора(ФормаОплатыТруда));
			ДанныеОбъекта.Вставить("Должность",                  ДанныеДоговора.РаботаДолжность);  
			//ТокмаковАМ
			
			//код для получения текущего ген. директора
			ТекТаблицаОтветственныеЛицаОрганизации = ОтветственныеЛицаСервер.ПолучитьТаблицуОтветственныхЛицПоОтбору(Новый Структура("Организация, Дата", МассивОбъектов[0].ГоловнаяОрганизация, ТекущаяДата()));
			ТекМассивОтветственныеЛицаОрганизации = Новый Массив; 
			Если ТекТаблицаОтветственныеЛицаОрганизации.Количество() Тогда
				МассивОтветственныеЛицаОрганизации = ТекТаблицаОтветственныеЛицаОрганизации.НайтиСтроки(Новый Структура("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель));
			КонецЕсли;
			
			Если МассивОтветственныеЛицаОрганизации.Количество() Тогда
				ОтветственныеЛицаОрганизации = МассивОтветственныеЛицаОрганизации[0];
			Иначе
				ОтветственныеЛицаОрганизации = Новый Структура;
				Для каждого ТекКолонка Из ТекТаблицаОтветственныеЛицаОрганизации.Колонки Цикл
					Если ТекКолонка.Имя = "ФизическоеЛицо" Тогда
						ОтветственныеЛицаОрганизации.Вставить(ТекКолонка.Имя, Справочники.ФизическиеЛица.ПустаяСсылка());
					ИначеЕсли ТекКолонка.Имя = "ПравоПодписиПоДоверенности" Тогда
						ОтветственныеЛицаОрганизации.Вставить(ТекКолонка.Имя, Ложь);
					Иначе
						ОтветственныеЛицаОрганизации.Вставить(ТекКолонка.Имя);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;   
			ТекРуководительОрганизации = ОтветственныеЛицаОрганизации.ФизическоеЛицо;
			
			//код для получения текущего юр.адреса
			ТекСведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(МассивОбъектов[0].ГоловнаяОрганизация, ТекущаяДата()); 
			
			
			ДанныеОбъекта.Вставить("ОрганизацияФИОРуководителяИнициалыИП",СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ТекРуководительОрганизации),,, Истина)); 
			ДанныеОбъекта.Вставить("ОрганизацияАдресЮридический", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(ТекСведенияОбОрганизации, "ЮридическийАдрес"))); 
			
			//код для получения тек. руководителя         
			ПолРуководителяОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекРуководительОрганизации, "Пол");
			ПолРуководителяОрганизацииЧислом = ?(Перечисления.ПолФизическогоЛица.Женский = ПолРуководителяОрганизации, 2, 1);
			ДанныеОбъекта.Вставить("ОрганизацияФИОРуководителяРП", "");
			ФизическиеЛицаЗарплатаКадры.Просклонять(СтрокаДоговора(СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекРуководительОрганизации, "Наименование"))), 2, ДанныеОбъекта.ОрганизацияФИОРуководителяРП, ПолРуководителяОрганизацииЧислом);
			
			
			//ТокмаковАМ
			
			
			////// Заполнение данных объекта
			
			////// Вывод областей макета
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");			
			Если ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИзмАдреса" Тогда
				Если ТекущиеДанныеФизЛицаСотрудника.ФизическоеЛицоПол = Перечисления.ПолФизическогоЛица.Женский Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("Текст");
				Иначе
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстМуж");
				КонецЕсли;		
			ИначеЕсли ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСрокиВыплаты" Тогда
				//270420 Агро-Менеджмент {{
				ДолжностьСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Ложь,ДанныеДоговора.РаботаСотрудник,"Должность", ТекущаяДата());
				Если ДолжностьСотрудника.Количество() > 0 Тогда
					ДанныеОбъекта.Вставить("СотрудникДолжность",         СтрокаДоговора(ДолжностьСотрудника[0].Должность.Наименование));
					ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег",    СтрокаДоговора(ДолжностьСотрудника[0].Должность.Наименование, Истина));
				КонецЕсли;
				
				РаботаДолжность = СтрокаДоговора(ДолжностьСотрудника[0].Должность.Наименование);
				//270420 Агро-Менеджмент }}
				
				Если РаботаДолжность = "Овощевод" Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстОвощеводы");
				ИначеЕсли РаботаДолжность = "Главный агроном-заместитель генерального директора по производству" Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстГлавныйАгроном");
				ИначеЕсли РаботаДолжность = "Ведущий агроном-бригадир отделения" 
					ИЛИ РаботаДолжность = "Агроном-бригадир отделения" 
					ИЛИ РаботаДолжность = "Агроном рассадного отделения" Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстВедущийАгрономБригадир");
				ИначеЕсли РаботаДолжность = "Агроном по карантину, мониторингу и защите растений" 
					ИЛИ РаботаДолжность = "Помощник агронома по карантину, мониторингу и защите растений" Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстАгрономПоЗащите");
				ИначеЕсли РаботаДолжность = "Рабочий по карантину и мониторингу" 
					ИЛИ РаботаДолжность = "Рабочий по карантину, мониторингу и защите растений" Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстРабочиеПоКарантину");
				ИначеЕсли РаботаДолжность = "Главный инженер" Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстГлавныйИнженер");
				ИначеЕсли РаботаДолжность = "Инженер-технолог" Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстИнженерТехнолог");
				ИначеЕсли РаботаДолжность = "Оператор теплиц"
					ИЛИ РаботаДолжность = "Слесарь по обслуживанию тепловых сетей, технологических систем и оборудования" 
					ИЛИ РаботаДолжность = "Слесарь по ремонту и обслуживанию КИПиА" Тогда
					ОбластьТекст = Макет.ПолучитьОбласть("ТекстИМСРабочие");
				Иначе
					ОбластьТекст = Макет.ПолучитьОбласть("Текст");
				КонецЕсли;	
			// Исправление должности для макета "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" Орёл П. А. 01.10.2026
			ИначеЕсли ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" или ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруCОУТ"  Тогда
			    ДолжностьСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, ДанныеДоговора.РаботаСотрудник, "Должность", ТекущаяДата());
			    Если ДолжностьСотрудника.Количество() > 0 Тогда
			        ДанныеОбъекта.Вставить("СотрудникДолжность",      СтрокаДоговора(ДолжностьСотрудника[0].Должность.Наименование));
			        ДанныеОбъекта.Вставить("СотрудникДолжностьВНРег", СтрокаДоговора(ДолжностьСотрудника[0].Должность.Наименование, Истина));
			    КонецЕсли;
			    ОбластьТекст = Макет.ПолучитьОбласть("Текст");
			// Конец исправления Орёл П. А. 01.10.2026
														
				
			Иначе
				ОбластьТекст = Макет.ПолучитьОбласть("Текст");
			КонецЕсли; 
			
			если ДанныеДоговора.РаботаОрганизацияИНН = "1108023823" и (ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" ИЛИ ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруCОУТ")  Тогда
				ОбластьТекст = Макет.ПолучитьОбласть("ТекстТКС");     
			Иначеесли ДанныеДоговора.РаботаОрганизацияИНН = "5921034316" и ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" Тогда   //	ГолубеваКК 13.10.2025
				ОбластьТекст = Макет.ПолучитьОбласть("ТекстТКП");
			КонецЕсли;  
			
			
			
			
			ОбластьПодписи   = Макет.ПолучитьОбласть("Подписи");
					
			////  ГолубеваКК 01.10.2026
			//Если ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" И ДанныеДоговора.РаботаОрганизацияИНН = "5921034316" ИЛИ ДанныеДоговора.РаботаОрганизацияИНН = "1108023823" Тогда
			//	ОбластьЗаголовок.Параметры.ТекущаяДата = "01 октября 2026 г.";  
			//КонецЕсли;
			
			//  ГолубеваКК 01.10.2026
			Если ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" И ДанныеДоговора.РаботаОрганизацияИНН = "5921034316" ИЛИ ДанныеДоговора.РаботаОрганизацияИНН = "1108023823" Тогда
				ОбластьПодписи.Параметры.ТекущаяДата = "01 октября 2026 г.";
			КонецЕсли;

					
			// Вывод данных в заголовок договора
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
			Если ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСуммаДолжность" Тогда 		
				ОбластьЗаголовок.Параметры.ТекущаяДата = ТекущаяДата();//"1 сентября 2023 г.";  	
			ИначеЕсли (ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" ИЛИ ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСОУТ") И (ДанныеДоговора.РаботаОрганизацияИНН = "5921034316" ИЛИ ДанныеДоговора.РаботаОрганизацияИНН = "1108023823") Тогда
				ОбластьЗаголовок.Параметры.ТекущаяДата = "01 октября 2026 г.";  	       		
			Иначе
				// ++ бит_п_Новоселов А.И. 06.02.2025 #0000027509
				//Если не ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" Тогда
				// -- бит_п_Новоселов А.И. 06.02.2025
				ОбластьЗаголовок.Параметры.ТекущаяДата = ТекущаяДата();  
				// ++ бит_п_Новоселов А.И. 06.02.2025 #0000027509
				//КонецЕсли;
				// -- бит_п_Новоселов А.И. 06.02.2025
			КонецЕсли;
			
		
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			// Вывод данных в текст договора
			// Выведем "ОбластьТекст" в табличный документ фрагментами, с целью более полного заполнения формата страницы
			ОбластьТекст.Параметры.Заполнить(ДанныеОбъекта);                               
			Если ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСуммаДолжность" Тогда 
				ОбластьТекст.Параметры.ТекущаяДата = ТекущаяДата();// "1 сентября 2023 г.";    
				
				КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Ложь,ДанныеДоговора.РаботаСотрудник,"Должность,ТекущаяТарифнаяСтавка,Подразделение", Дата("20260901235959"));
				РаботаДолжность = СтрокаДоговора(КадровыеДанныеСотрудника[0].Должность.Наименование);  
				РаботаПодразделение = КадровыеДанныеСотрудника[0].Подразделение.Наименование;
				
			    ОбластьТекст.Параметры.СотрудникДолжность = РаботаДолжность;
			    ОбластьТекст.Параметры.Подразделение = РаботаПодразделение;     
				
				
				//Получение информации о начислениях
				СотрудникиПериоды = Новый ТаблицаЗначений;
				СотрудникиПериоды.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
				СотрудникиПериоды.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
				
				НоваяСтрока = СотрудникиПериоды.Добавить(); 
				
				
				НоваяСтрока.Период = Дата("20260901235959");  							
				НоваяСтрока.Сотрудник = ДанныеДоговора.РаботаСотрудник;
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				Запрос.УстановитьПараметр("СотрудникиПериоды", СотрудникиПериоды);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СотрудникиПериоды.Период КАК Период,
				|	СотрудникиПериоды.Сотрудник КАК Сотрудник
				|ПОМЕСТИТЬ ВТСотрудникиПериоды
				|ИЗ
				|	&СотрудникиПериоды КАК СотрудникиПериоды";
				
				Запрос.Выполнить();
				
				НачисленияСотрудников = ТаблицаНачисленийСотрудниковПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
				
				ФормаОплатыТруда = ?(СтрНайти(НачисленияСотрудников[0].ПоказательОкладТариф.ИмяПредопределенныхДанных,"ТарифнаяСтавкаЧасовая")>0,"почасовая оплата труда из расчета","должностной оклад в размере");
				ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(НачисленияСотрудников[0].ТарифнаяСтавка, ВалютаСсылка);
				ОбластьТекст.Параметры.ФормаОплатыТруда = ФормаОплатыТруда;
				ОбластьТекст.Параметры.ОкладСумма = НачисленияСотрудников[0].ТарифнаяСтавка;
				ОбластьТекст.Параметры.ОкладСуммаПрописью = ОкладСуммаПрописью; 
				
			КонецЕсли; 
			Если  ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" или ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруCОУТ"  Тогда 
			   
				
			//	КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Ложь,ДанныеДоговора.РаботаСотрудник,"Должность,ТекущаяТарифнаяСтавка,Подразделение", Дата("20250901235959"));
			//	РаботаДолжность = СтрокаДоговора(КадровыеДанныеСотрудника[0].Должность.Наименование);  
			//	РаботаПодразделение = КадровыеДанныеСотрудника[0].Подразделение.Наименование;
			//	
			 //   ОбластьТекст.Параметры.СотрудникДолжность = РаботаДолжность;
			 //   ОбластьТекст.Параметры.Подразделение = РаботаПодразделение;     
			//	
				
				//Получение информации о начислениях
				СотрудникиПериоды = Новый ТаблицаЗначений;
				СотрудникиПериоды.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
				СотрудникиПериоды.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
				
				НоваяСтрока = СотрудникиПериоды.Добавить(); 
				
				
				НоваяСтрока.Период = Дата("20261001235959");  							
				НоваяСтрока.Сотрудник = ДанныеДоговора.РаботаСотрудник;
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				Запрос.УстановитьПараметр("СотрудникиПериоды", СотрудникиПериоды);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СотрудникиПериоды.Период КАК Период,
				|	СотрудникиПериоды.Сотрудник КАК Сотрудник
				|ПОМЕСТИТЬ ВТСотрудникиПериоды
				|ИЗ
				|	&СотрудникиПериоды КАК СотрудникиПериоды";
				
				Запрос.Выполнить();
				
				НачисленияСотрудников = ТаблицаНачисленийСотрудниковПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
				
				// ГолубеваКК -- 01.10.2026
				Если ДанныеДоговора.РаботаОрганизацияИНН = "5921034316" тогда        
					ФормаОплатыТруда = ?(СтрНайти(НачисленияСотрудников[0].ПоказательОкладТариф.ИмяПредопределенныхДанных,"ТарифнаяСтавкаЧасовая")>0,"почасовая оплата труда из расчета","должностной оклад в размере");
				КонецЕсли;
								
				ОкладСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(НачисленияСотрудников[0].ТарифнаяСтавка, ВалютаСсылка);   
				ОбластьТекст.Параметры.ОкладСумма = Формат(НачисленияСотрудников[0].ТарифнаяСтавка,"ЧДЦ=2"); //        Сообщить(Формат(ОбластьТекст.Параметры.ОкладСумма,"ЧДЦ=2")); Сообщить(Формат(НачисленияСотрудников[0].ТарифнаяСтавка,"ЧДЦ=2"));
				ОбластьТекст.Параметры.ОкладСуммаПрописью = ОкладСуммаПрописью;
				Приказ = "";
				если ДанныеДоговора.РаботаОрганизацияИНН = "1108023823" тогда 
					Приказ = "№ 786-лс от 01.10.2026 «Об индексации заработной платы и внесении изменений в штатное расписание ООО Тепличный комплекс «Сосногорский»";//Орёл П.А. 01.10.2026
				иначеесли ДанныеДоговора.РаботаОрганизацияИНН = "5921034316" тогда 
					ОбластьТекст.Параметры.ФормаОплатыТруда = ФормаОплатыТруда;
					Приказ = "№ 252 от 25 сентября 2026 г. «Об индексации заработной платы и внесении изменений в штатное расписание ООО ТК «Пермский»";      // ГолубеваКК 01.10.2026
				иначеесли ДанныеДоговора.РаботаОрганизацияИНН ="2130184747" тогда         
					ОбластьТекст.Параметры.ФормаОплатыТруда = ФормаОплатыТруда;
					Приказ = "НЧБ";
				конецесли;
				ОбластьТекст.Параметры.Приказ = Приказ;	
				// ++ бит_п_Новоселов А.И. 06.02.2025 #0000027509	 + ГолубеваКК 13.10.2025   + ОрёлПА 14.10.2025
				Если ДанныеДоговора.РаботаОрганизацияИНН = "5921034316"  или ДанныеДоговора.РаботаОрганизацияИНН = "1108023823" тогда
					ОбластьТекст.Параметры.ТекущаяДата = "01 октября 2026 г.";
				Иначе
					ОбластьТекст.Параметры.ТекущаяДата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");  
				// -- бит_п_Новоселов А.И. 06.02.2025   + ГолубеваКК 13.10.2025
				КонецЕсли;														
			КонецЕсли;
			
			ВывестиОбластьТабличногоДокументаФрагментами(ОбластьТекст, ТабличныйДокумент); 
			
			// Вывод данных в подписи договора
			// Выведем "ОбластьПодписи" в табличный документ по-строчно, с целью более полного заполнения формата страницы  
			
			//ТокмаковАМ     
			Если ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСуммаДолжность" Тогда 		   
				ДанныеОбъекта.Вставить("ТекущаяДата", "1 сентября 2023 г.");       
				//	ГолубеваКК 13.10.2025  	 + Орёл П.А 14.10.2025
			ИначеЕсли  ИмяМакета = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация" И ДанныеДоговора.РаботаОрганизацияИНН = "5921034316" ИЛИ ДанныеДоговора.РаботаОрганизацияИНН = "1108023823"
				
				Тогда     
				ДанныеОбъекта.Вставить("ТекущаяДата", "01 октября 2026 г.");      
			//	ГолубеваКК 13.10.2025  
           	Иначе
				// ++ бит_п_Новоселов А.И. 06.02.2025 #0000027509	 + ГолубеваКК 13.10.2025
				Если ДанныеДоговора.РаботаОрганизацияИНН = "5921034316" тогда
					ОбластьТекст.Параметры.ТекущаяДата = "01 октября 2026 г.";
				Иначе
					ОбластьТекст.Параметры.ТекущаяДата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");  
				// -- бит_п_Новоселов А.И. 06.02.2025   + ГолубеваКК 13.10.2025
				КонецЕсли;				
			КонецЕсли; 	

			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);
			
			//ТокмаковАМ

			
			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);
			Если ИмяМакета = "ПФ_MXL_ТрудовойДоговор" или ИмяМакета = "ПФ_MXL_ТрудовойДоговор_Общий" Тогда
				
				// Для макета "ТрудовойДоговор" подписи всегда должны выводиться на отдельной странице			
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
				
			Иначе
				ВывестиОбластьТабличногоДокументаФрагментами(ОбластьПодписи, ТабличныйДокумент);
			КонецЕсли;      
			
						
				
			
			////// Вывод областей макета
			
			// Выведем нужное количество экземпляров (при печати комплектов)
			Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
				ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
				Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьКопирования);
				КонецЦикла;
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДоговора.РаботаСотрудник);
			
		КонецЦикла;
		
		// На всякий случай добавим еще сюда
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция ПолучитьДанныеДляПечатнойФормыТрудовойДоговор(МассивОбъектов, ПечатьИзПриказаОПриеме = Ложь) //9428 ASTRA ГайнаДИ AddOn Begin
		
		ДанныеДляПечати = Новый Структура;
		
		////// Данные договоров ////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		ИмяОтчета                = "Отчет.ПечатнаяФормаТрудовойДоговорМикропредприятий";
		ПутьКВариантуОтчета      = "Отчет.ПечатнаяФормаТрудовойДоговорМикропредприятий.ТрудовойДоговорМикропредприятий";
		ПутьКМакетуПечатнойФормы = "ОбщийМакет.ПФ_MXL_ТрудовойДоговорМикропредприятий";
		ИмяМакетаПечатнойФормы   = "ПФ_MXL_ТрудовойДоговорМикропредприятий";
		КлючВарианта             = "ТрудовойДоговорМикропредприятий";
		
		ОбъектОтчета = ОбщегоНазначения.ОбъектПоПолномуИмени(ИмяОтчета);
		
		НастройкиОтчетаКД = Неопределено;
		ПользовательскиеНастройкиКД = Неопределено;
		
		ЗарплатаКадрыОтчеты.ИнициализироватьНастройкиОтчета(ОбъектОтчета, "", КлючВарианта, НастройкиОтчетаКД, ПользовательскиеНастройкиКД);
		
		Если НастройкиОтчетаКД = Неопределено Тогда
			НастройкиОтчетаКД = ОбъектОтчета.СхемаКомпоновкиДанных.ВариантыНастроек[КлючВарианта].Настройки;
		КонецЕсли;
		
		ОбъектОтчета.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчетаКД);
		Если ТипЗнч(ПользовательскиеНастройкиКД) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
			ОбъектОтчета.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройкиКД);
		КонецЕсли;
		
		////
		//ЗарплатаКадрыОтчеты.УстановитьПараметрОтбора(ОбъектОтчета, МассивОбъектов);
		Если ПечатьИзПриказаОПриеме Тогда 
			Если ТипЗнч(МассивОбъектов[0]) = Тип("СправочникСсылка.Сотрудники") Тогда
				
				ПечатаемыеСсылки = Новый Массив;
				КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, МассивОбъектов, "ПриказОПриеме");
				Для Каждого Сотрудник Из МассивОбъектов Цикл
					
					СтрокаДанных = КадровыеДанные.Найти(Сотрудник, "Сотрудник");
					Если СтрокаДанных <> Неопределено И ЗначениеЗаполнено(СтрокаДанных.ПриказОПриеме) Тогда
						ПечатаемыеСсылки.Добавить(СтрокаДанных.ПриказОПриеме);
					Иначе
						ПечатаемыеСсылки.Добавить(Сотрудник);
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			ЗарплатаКадрыОтчеты.УстановитьПараметрОтбора(ОбъектОтчета, ПечатаемыеСсылки);
		Иначе 
			ЗарплатаКадрыОтчеты.УстановитьПараметрОтбора(ОбъектОтчета, МассивОбъектов);	
		КонецЕсли;
		////
		
		СписокОтборов = Новый Массив;
		
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		СписокОтборов, "СсылкаНаСотрудника", ВидСравненияКомпоновкиДанных.ВСписке, ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивОбъектов));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Отбор", СписокОтборов);
		
		ВнешниеНаборыДанных = Отчеты.ПечатнаяФормаТрудовойДоговорМикропредприятий.ВнешниеНаборыДанных();
		
		РезультатКомпоновки = ЗарплатаКадрыОтчеты.РезультатКомпоновкиМакетаПечатнойФормы(ОбъектОтчета, , , ВнешниеНаборыДанных, ДополнительныеПараметры);
		
		ДанныеДоговоров = РезультатКомпоновки.ДанныеОтчета.Строки;
		
		ДанныеДляПечати.Вставить("ДанныеДоговоров", ДанныеДоговоров);
		
		////// Данные договоров ////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		Запрос.Текст = "ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.ГоловнаяОрганизация КАК Организация,
		|	Сотрудники.ГоловнаяОрганизация.ОГРН КАК ОрганизацияОГРН,
		|	Сотрудники.ГоловнаяОрганизация.ИНН КАК ОрганизацияИНН,
		|	Сотрудники.ГоловнаяОрганизация.КПП КАК ОрганизацияКПП,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ФизическоеЛицо.Пол КАК ФизическоеЛицоПол,
		|	Сотрудники.ФизическоеЛицо.ИНН КАК ФизическоеЛицоИНН,
		|	Сотрудники.ФизическоеЛицо.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
		|	Сотрудники.ФизическоеЛицо.ДатаРождения КАК ФизическоеЛицоДатаРождения
		|ПОМЕСТИТЬ ДанныеФизЛицСотрудников
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&МассивОбъектов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудники.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеФизЛицСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК АдресПоПрописке
		|ПОМЕСТИТЬ КИФизЛицСотрудников
		|ИЗ
		|	ДанныеФизЛицСотрудников КАК ДанныеФизЛицСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|		ПО ДанныеФизЛицСотрудников.ФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.Организация КАК Организация,
		|	Сотрудники.ОрганизацияОГРН КАК ОрганизацияОГРН,
		|	Сотрудники.ОрганизацияИНН КАК ОрганизацияИНН,
		|	Сотрудники.ОрганизацияКПП КАК ОрганизацияКПП,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ФизическоеЛицоПол КАК ФизическоеЛицоПол,
		|	Сотрудники.ФизическоеЛицоИНН КАК ФизическоеЛицоИНН,
		|	Сотрудники.ФизическоеЛицоСтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
		|	Сотрудники.ФизическоеЛицоДатаРождения КАК ФизическоеЛицоДатаРождения,
		|	КИФизЛицСотрудников.АдресПоПрописке КАК АдресПоПрописке
		|ИЗ
		|	ДанныеФизЛицСотрудников КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ КИФизЛицСотрудников КАК КИФизЛицСотрудников
		|		ПО Сотрудники.ФизическоеЛицо = КИФизЛицСотрудников.ФизическоеЛицо";
		
		ДанныеФизическихЛицСотрудников = Запрос.Выполнить();
		
		ДанныеДляПечати.Вставить("ДанныеФизическихЛицСотрудников", ДанныеФизическихЛицСотрудников.Выгрузить());
		ДанныеДляПечати.ДанныеФизическихЛицСотрудников.Индексы.Добавить("Сотрудник");
		
		//ДанныеДляПечатиКадровогоПриказа = КадровыйУчет.СформироватьЗапросДляТ1(МассивОбъектов).Выгрузить();
		//КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, МассивОбъектов, "Организация, Подразделение, Должность, ТарифнаяСтавка");	
		//КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, СписокФизическихЛиц, "ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан");
		
		Возврат ДанныеДляПечати; 
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Процедура ДополнитьДанныеОбъектаИнформациейОбОрганизации(ДанныеОбъекта, Организация, ДатаПолученияИнформации, ТекущиеДанныеФизЛицаСотрудника) //9428 ASTRA ГайнаДИ AddOn Begin
		
		// Сведения об организации
		
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = ТекущиеДанныеФизЛицаСотрудника.Организация;
		КонецЕсли;
		
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ДатаПолученияИнформации);  
		
		ТаблицаОтветственныеЛицаОрганизации = ОтветственныеЛицаСервер.ПолучитьТаблицуОтветственныхЛицПоОтбору(Новый Структура("Организация, Дата", Организация, ДатаПолученияИнформации));
		МассивОтветственныеЛицаОрганизации = Новый Массив;
		Если ТаблицаОтветственныеЛицаОрганизации.Количество() Тогда
			МассивОтветственныеЛицаОрганизации = ТаблицаОтветственныеЛицаОрганизации.НайтиСтроки(Новый Структура("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель));
		КонецЕсли;
		
		Если МассивОтветственныеЛицаОрганизации.Количество() Тогда
			ОтветственныеЛицаОрганизации = МассивОтветственныеЛицаОрганизации[0];
		Иначе
			ОтветственныеЛицаОрганизации = Новый Структура;
			Для каждого ТекКолонка Из ТаблицаОтветственныеЛицаОрганизации.Колонки Цикл
				Если ТекКолонка.Имя = "ФизическоеЛицо" Тогда
					ОтветственныеЛицаОрганизации.Вставить(ТекКолонка.Имя, Справочники.ФизическиеЛица.ПустаяСсылка());
				ИначеЕсли ТекКолонка.Имя = "ПравоПодписиПоДоверенности" Тогда
					ОтветственныеЛицаОрганизации.Вставить(ТекКолонка.Имя, Ложь);
				Иначе
					ОтветственныеЛицаОрганизации.Вставить(ТекКолонка.Имя);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		РуководительОрганизации = ОтветственныеЛицаОрганизации.ФизическоеЛицо;
		ДолжностьРуководителяОрганизации = ОтветственныеЛицаОрганизации.Должность;
		
		ПолРуководителяОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РуководительОрганизации, "Пол");
		ПолРуководителяОрганизацииЧислом = ?(Перечисления.ПолФизическогоЛица.Женский = ПолРуководителяОрганизации, 2, 1);
		
		ДанныеОбъекта.Вставить("Организация", Организация);
		ДанныеОбъекта.Вставить("ОрганизацияНаименованиеСокращенное", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "СокращенноеНаименование")));
		ДанныеОбъекта.Вставить("ОрганизацияОфициальноеНаименование", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ОфициальноеНаименование")));
		
		ДанныеОбъекта.Вставить("ОрганизацияАдресФактический", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ФактическийАдрес")));
		ДанныеОбъекта.Вставить("ОрганизацияАдресЮридический", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес")));
		ДанныеОбъекта.Вставить("ОрганизацияИНН", СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ОрганизацияИНН));
		ДанныеОбъекта.Вставить("ОрганизацияКПП", СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ОрганизацияКПП));
		ДанныеОбъекта.Вставить("ОрганизацияОГРН", СтрокаДоговора(ТекущиеДанныеФизЛицаСотрудника.ОрганизацияОГРН));
		
		ДанныеОбъекта.Вставить("НомерСчета", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НомерСчета")));
		ДанныеОбъекта.Вставить("КоррСчет", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КоррСчет")));
		ДанныеОбъекта.Вставить("Банк", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "Банк")));
		ДанныеОбъекта.Вставить("БИК", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "БИК")));
		ДанныеОбъекта.Вставить("Телефоны", СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "Телефоны")));
		ДанныеОбъекта.Вставить("ЭлектроннаяПочта",СтрокаДоговора(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ЭлектроннаяПочта")));
		
		
		
		//1 - Именительный, 2 - Родительный, 3 - Дательный, 4 - Винительный, 5 - Творительный, 6 - Предложный.
		// У Агроменеджмента чтобы получить официальное наименование организации в Дательном падеже для ПФ "Согласие на обработку персональных данных"
		// нужно было заполнить регистр слов исключений, но так как у некоторых организаций в официальных наименованиях были одинаковые слова, но в разных регистрах,
		// то и на выходе мы получали одинаковые слова, правильно просклоненные, но в разных регистрах, для решения этого вопроса было принято решение переводить все слова
		// в нижний регистр с заглавными буквами, а для этого нужно передать в функцию ASTRAПроцедурыСервер.Просклонять() параметр ФИО = Истина, в данном случае 
		// параметр ВНижнийРегистр = Ложь, чтобы функция не переводила слова исключения в нижний регистр, значения иметь не будет, так как все равно все слова будут переводиться
		// в нижний регистр и у каждого слова первая буква будет преобразовываться к заглавной
		ДанныеОбъекта.Вставить("ОрганизацияОфициальноеНаименованиеДПВсеСЗаглавной", СтрокаДоговора(ASTRAПроцедурыСервер.Просклонять(ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ОфициальноеНаименование"), 3, 1, Истина, Ложь)));
		
		ДанныеОбъекта.Вставить("ОрганизацияДолжностьРуководителяИПСЗаглавной", СтрокаДоговора(ПервоеСловоСЗаглавной(ДолжностьРуководителяОрганизации))); 
		
		Если ТекущиеДанныеФизЛицаСотрудника.Организация.ГоловнаяОрганизация.ИНН = "1108023823" Тогда;
			ДанныеОбъекта.Вставить("ОрганизацияДолжностьРуководителяИПСЗаглавной", "Генеральный директор");
		КонецЕсли;

		
		ДанныеОбъекта.Вставить("ОрганизацияДолжностьРуководителяИП", СтрокаДоговора(ДолжностьРуководителяОрганизации, Истина));
		ДанныеОбъекта.Вставить("ОрганизацияДолжностьРуководителяРПСЗаглавной", СтрокаДоговора(ПервоеСловоСЗаглавной(ASTRAПроцедурыСервер.Просклонять(НРег(ДолжностьРуководителяОрганизации), 2, ПолРуководителяОрганизацииЧислом))));
		ДанныеОбъекта.Вставить("ОрганизацияДолжностьРуководителяРП", СтрокаДоговора(ASTRAПроцедурыСервер.Просклонять(НРег(ДолжностьРуководителяОрганизации), 2, ПолРуководителяОрганизацииЧислом)));
		ДанныеОбъекта.Вставить("ОрганизацияДолжностьРуководителяДПСЗаглавной", СтрокаДоговора(ПервоеСловоСЗаглавной(ASTRAПроцедурыСервер.Просклонять(НРег(ДолжностьРуководителяОрганизации), 3, ПолРуководителяОрганизацииЧислом))));
		ДанныеОбъекта.Вставить("ОрганизацияДолжностьРуководителяТП", СтрокаДоговора(ASTRAПроцедурыСервер.Просклонять(НРег(ДолжностьРуководителяОрганизации), 5, ПолРуководителяОрганизацииЧислом)));
		
		ДанныеОбъекта.Вставить("ОрганизацияФИОРуководителяРП", "");
		ФизическиеЛицаЗарплатаКадры.Просклонять(СтрокаДоговора(СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РуководительОрганизации, "Наименование"))), 2, ДанныеОбъекта.ОрганизацияФИОРуководителяРП, ПолРуководителяОрганизацииЧислом);
		
		ДанныеОбъекта.Вставить("ОрганизацияФИОРуководителяДП", "");
		ФизическиеЛицаЗарплатаКадры.Просклонять(СтрокаДоговора(СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РуководительОрганизации, "Наименование"))), 3, ДанныеОбъекта.ОрганизацияФИОРуководителяДП, ПолРуководителяОрганизацииЧислом);
		
		
		ДанныеОбъекта.Вставить("ОрганизацияФИОРуководителяИнициалыИП", СтрокаДоговора(ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(РуководительОрганизации),,, Истина));
		
		Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо 
			ИЛИ СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель 
			Тогда
			ДанныеОбъекта.Вставить("ОрганизацияИменуемое", ?(ПолРуководителяОрганизации = Перечисления.ПолФизическогоЛица.Женский, "именуемая", "именуемый"));
		Иначе
			ДанныеОбъекта.Вставить("ОрганизацияИменуемое", "именуемое");	
		КонецЕсли;
		
		ДанныеОбъекта.Вставить("ОрганизацияДействующее", ?(ПолРуководителяОрганизации = Перечисления.ПолФизическогоЛица.Женский, "действующей", "действующего"));
		ДанныеОбъекта.Вставить("ОрганизацияОснованиеДействия", ?(ОтветственныеЛицаОрганизации.ПравоПодписиПоДоверенности, СтрокаДоговора(ОтветственныеЛицаОрганизации.ОснованиеПраваПодписи, Истина), "Устава"));
		
	КонецПроцедуры //ASTRA ГайнаДИ AddOn End
	
	Процедура ВывестиОбластьТабличногоДокументаФрагментами(ОбластьМакета, ТабличныйДокумент) //9428 ASTRA ГайнаДИ AddOn Begin
		
		////Выведем область табличного документа 
		////с проверкой вывода в каретку драйвера печати
		//
		////Область помещается
		//Если ТабличныйДокумент.ПроверитьВывод(ОбластьМакета) Тогда
		//	ТабличныйДокумент.Вывести(ОбластьМакета);
		//	Возврат;
		//КонецЕсли;
		//
		//// Область не вместилась, попробуем вывести её фрагментами
		//НачалоОбласти = 1;
		//сч = 1;
		//Пока сч <= ОбластьМакета.ВысотаТаблицы Цикл
		//	
		//	ФрагментОбластиМакета = ОбластьМакета.ПолучитьОбласть(НачалоОбласти,, сч);
		//	Если ТабличныйДокумент.ПроверитьВывод(ФрагментОбластиМакета) Тогда
		//		//Фрагмент "влезает", пропускаем
		//		сч = сч + 1;
		//		Продолжить;
		//	КонецЕсли;
		
		//	//Фрагмент "не влез", получим фрагмент, на одну строку меньше
		//	ФрагментОбластиМакета = ОбластьМакета.ПолучитьОбласть(НачалоОбласти,, сч - 1);
		//	
		//	//Выведем фрагмент области табличного документа, влезающую на страницу
		//	ТабличныйДокумент.Вывести(ФрагментОбластиМакета);
		//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//	
		//	// Далее цикл начнется с текущего сч, так как здесь мы его не увеличиваем и на следующем листе снова будет проверяться
		//	// возможность вывода остатка области, потому что оставшаяся область теоретически может не влезть и на следующий лист
		//	
		//	НачалоОбласти = сч;
		//	
		//КонецЦикла;
		
		
		//Область помещается
		Если ТабличныйДокумент.ПроверитьВывод(ОбластьМакета) Тогда
			ТабличныйДокумент.Вывести(ОбластьМакета);
			Возврат;
		КонецЕсли;
		
		//Область не помещается, 
		//попробуем часть области вписать в страницу по-строчно,
		//чтобы избежать пустых мест на странице
		КоличествоСтрокОбласти = ОбластьМакета.ПолучитьРазмерОбластиДанныхПоВертикали();
		
		Б = 0;
		Пока Б < КоличествоСтрокОбласти Цикл
			Б = Б + 1;
			ФрагментОбластиМакета = ОбластьМакета.ПолучитьОбласть(1,, Б);
			Если ТабличныйДокумент.ПроверитьВывод(ФрагментОбластиМакета) Тогда
				//Фрагмент "влезает", пропускаем
				Продолжить;
			КонецЕсли;
			
			//Фрагмент "не влез", получим фрагмент, на одну строку меньше
			ФрагментОбластиМакета = ОбластьМакета.ПолучитьОбласть(1,, Б - 1);
			
			//Выведем фрагмент области табличного документа, влезающую на страницу
			ТабличныйДокумент.Вывести(ФрагментОбластиМакета);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			//Выведем оставшуюся часть области табличного документа
			//на следующую на страницу
			ОстатокОбластиМакета = ОбластьМакета.ПолучитьОбласть(Б,, КоличествоСтрокОбласти);
			ТабличныйДокумент.Вывести(ОстатокОбластиМакета);
			Прервать;
		КонецЦикла;
		
	КонецПроцедуры //ASTRA ГайнаДИ AddOn End
	
	Функция ТаблицаНачисленийСотрудниковПоВременнойТаблице(МенеджерВременныхТаблиц, ИмяВТСотрудникиПериоды, ИмяПоляПериод = "Период", ИмяПоляСотрудник = "Сотрудник", ИмяПоляДатаОкончания = "", ИспользоватьКраткиеПредставления = Истина, ВыводитьДенежныеПоказателиСВалютой = Ложь, ФормироватьСПериодичностьДень = Истина) Экспорт
	
	НачисленияСотрудников = Новый ТаблицаЗначений;
	НачисленияСотрудников.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	НачисленияСотрудников.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	НачисленияСотрудников.Колонки.Добавить("ТарифнаяСтавка", Новый ОписаниеТипов("Число"));
	НачисленияСотрудников.Колонки.Добавить("ОписаниеОклада", Новый ОписаниеТипов("Строка"));
	НачисленияСотрудников.Колонки.Добавить("Надбавка", Новый ОписаниеТипов("Строка"));         
	НачисленияСотрудников.Колонки.Добавить("ПоказательОкладТариф", Новый ОписаниеТипов("СправочникСсылка.ПоказателиРасчетаЗарплаты"));	
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты") Тогда
		
		ОписанияНачислений = КадровыйУчет.ОписанияСоставаНачисленийПоВременнойТаблице(МенеджерВременныхТаблиц, ИмяВТСотрудникиПериоды, ИмяПоляПериод, ИмяПоляСотрудник, ИмяПоляДатаОкончания, ИспользоватьКраткиеПредставления, ВыводитьДенежныеПоказателиСВалютой, ФормироватьСПериодичностьДень);
		
		Для каждого ОписаниеСотрудника Из ОписанияНачислений Цикл
			
			Для каждого ОписаниеПериода Из ОписаниеСотрудника.Значение Цикл
				
				НоваяСтрока = НачисленияСотрудников.Добавить();
				
				НоваяСтрока.Сотрудник = ОписаниеСотрудника.Ключ;
				НоваяСтрока.Период = ОписаниеПериода.Ключ;
				НоваяСтрока.ТарифнаяСтавка = ОписаниеПериода.Значение.ОкладТариф;
				НоваяСтрока.ОписаниеОклада = ОписаниеПериода.Значение.ОписаниеОклада;
				НоваяСтрока.Надбавка = ОписаниеПериода.Значение.ОписаниеНадбавок;  
				НоваяСтрока.ПоказательОкладТариф = ОписаниеПериода.Значение.ПоказательОкладТариф;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НачисленияСотрудников;
	
КонецФункции

	//ТокмаковАМ
	Функция ПолучитьДолжностьСотрудника(Сотрудник);
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(Сотрудник);
	ТЗСведения = КадровыйУчет.КадровыеДанныеСотрудников(Истина,МассивСотрудников,"Должность",ТекущаяДата());
	Если ТЗСведения.Количество()>0 Тогда
		Должность = ТЗСведения[0].Должность;
	Иначе
		Должность = ПредопределенноеЗначение("Справочник.Должности.ПустаяСсылка");
	КонецЕсли;
	Возврат Должность;
	
КонецФункции
	
	#КонецОбласти
	
	#Область Прочее
	
	Функция СтрокаДоговора(Знач Стр, ВНижнийРегистр = Ложь, КороткаяСтрока = Ложь, НеЗабиватьПодчеркиванием = Ложь) //9428 ASTRA ГайнаДИ AddOn Begin
		
		Если НЕ ЗначениеЗаполнено(Стр) Тогда
			Если ТипЗнч(Стр) = Тип("Дата") Тогда
				Возврат """___""_________20__г.";
			ИначеЕсли КороткаяСтрока Тогда
				Возврат "___";
			ИначеЕсли НеЗабиватьПодчеркиванием Тогда
				Возврат "";
			Иначе			
				Возврат "_________________";
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Стр) = Тип("Дата") Тогда
			Результат = Формат(Стр, "ДФ='dd MMMM yyyy ""г.""'");
		Иначе
			Стр = СокрЛП(Стр);
			Если ВНижнийРегистр Тогда
				Стр = НРег(Стр);
			КонецЕсли;
			
			Если Найти(Врег(Стр), "УСТАВ") > 0 Тогда
				МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Стр, " ");
				
				МассивОбработанныхПодстрок = Новый Массив;
				Для каждого ТекПодСтрока Из МассивПодстрок Цикл
					ПодстрокаРезультат = "";
					Если Найти(Врег(ТекПодСтрока), "УСТАВ") > 0 Тогда
						ПодстрокаРезультат = ТРег(ТекПодСтрока);
						МассивОбработанныхПодстрок.Добавить(ПодстрокаРезультат);
					Иначе
						МассивОбработанныхПодстрок.Добавить(ТекПодСтрока);
					КонецЕсли;
				КонецЦикла;
				
				Стр = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивОбработанныхПодстрок, " ");
			КонецЕсли;
			
			Результат = Стр;
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция ПолучитьСтрокуТаблицы(Таблица, СтруктураПоиска) //9428 ASTRA ГайнаДИ AddOn Begin
		
		НайденныеСтроки = Таблица.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() Тогда
			СтрокаТаблицы = НайденныеСтроки[0];
		Иначе
			СтрокаТаблицы = Новый Структура;
			Для Каждого ТекКолонка Из Таблица.Колонки Цикл
				СтрокаТаблицы.Вставить(ТекКолонка.Имя);
			КонецЦикла;
		КонецЕсли;
		
		Возврат СтрокаТаблицы;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	Функция ПервоеСловоСЗаглавной(Стр) //9428 ASTRA ГайнаДИ AddOn Begin
		
		Если НЕ ЗначениеЗаполнено(Стр) Тогда
			Возврат Стр;
		КонецЕсли;
		
		ОбрабатываемаяСтрока = СокрЛП(Стр);
		
		ПерваяБукваВСтроке = Лев(ОбрабатываемаяСтрока, 1);
		
		ПерваяБукваВСтрокеВВРег = ВРег(ПерваяБукваВСтроке);
		
		ОбрабатываемаяСтрокаБезПервойБуквы = Прав(ОбрабатываемаяСтрока, СтрДлина(ОбрабатываемаяСтрока) - 1);
		
		ОбрабатываемаяСтрока = ПерваяБукваВСтрокеВВРег + ОбрабатываемаяСтрокаБезПервойБуквы;
		
		Возврат ОбрабатываемаяСтрока;
		
	КонецФункции //ASTRA ГайнаДИ AddOn End
	
	#КонецОбласти
	
	#Область Константы
	
	ИмяОбработки = Метаданные().Имя;
	Синоним		 = Метаданные().Синоним;
	Комментарий  = Метаданные().Комментарий;
	
	ОписаниеПечатныхФорм = Новый ТаблицаЗначений;
	ОписаниеПечатныхФорм.Колонки.Добавить("Макет");
	ОписаниеПечатныхФорм.Колонки.Добавить("МакетПредставление");
	ОписаниеПечатныхФорм.Колонки.Добавить("Назначение");
	
	#КонецОбласти
	
	#Область Назначения
	
	СписокНазначений = Новый СписокЗначений;
	СписокНазначений.Добавить("Справочник.Сотрудники");
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ТрудовойДоговор";
	НоваяСтрока.МакетПредставление = "Трудовой договор (режим сменный)";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ТрудовойДоговорСрочныйУпаковщик";
	НоваяСтрока.МакетПредставление = "Трудовой договор (срочный) Упаковщик";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ТрудовойДоговор_Общий";
	НоваяСтрока.МакетПредставление = "Трудовой договор (режим общий)";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ТрудовойДоговор_ТКП";
	НоваяСтрока.МакетПредставление = "ТК Пермский - Трудовой договор (режим сменный)";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ТрудовойДоговор_Общий_ТКП";
	НоваяСтрока.МакетПредставление = "ТК Пермский - Трудовой договор (режим общий)";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_Приложение2КТрудовомуДоговоруОНеразглашенииИнформации_ТКП";
	НоваяСтрока.МакетПредставление = "ТК Пермский - Приложение №2 к Трудовому договору Обязательство о неразглашении информации";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_Приложение3КТрудовомуДоговоруОНеразглашенииПерсональныхДанных_ТКП";
	НоваяСтрока.МакетПредставление = "ТК Пермский - Приложение №3 к Трудовому договору Обязательство о неразглашении персональных данных";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_СогласиеНаОбработкуПерсональныхДанных_ТКП";
	НоваяСтрока.МакетПредставление = "ТК Пермский - Согласие на обработку персональных данных";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСрокиВыплаты";
	НоваяСтрока.МакетПредставление = "Дополнительное соглашение к Трудовому договору (сроки выплаты)";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИзмАдреса";
	НоваяСтрока.МакетПредставление = "Дополнительное соглашение к Трудовому договору (изм. адреса)";
	НоваяСтрока.Назначение = СписокНазначений;
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруУточненияУсловийТруда";
	НоваяСтрока.МакетПредставление = "Дополнительное соглашение к Трудовому договору (уточнения условий труда)";
	НоваяСтрока.Назначение = СписокНазначений;   
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруСуммаДолжность";
	НоваяСтрока.МакетПредставление = "Дополнительное соглашение к Трудовому договору (должность, размер выплаты)";
	НоваяСтрока.Назначение = СписокНазначений; 
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ТрудовойДоговор_ОбщийАУП";
	НоваяСтрока.МакетПредставление = "Трудовой договор (режим общий) АУП";
	НоваяСтрока.Назначение = СписокНазначений; 
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруИндексация";
	НоваяСтрока.МакетПредставление = "Дополнительное соглашение к Трудовому договору (индексациия)";
	НоваяСтрока.Назначение = СписокНазначений;       
	
	НоваяСтрока = ОписаниеПечатныхФорм.Добавить();
	НоваяСтрока.Макет = "ПФ_MXL_ДополнительноеСоглашениеКТрудовомуДоговоруCОУТ";
	НоваяСтрока.МакетПредставление = "Дополнительное соглашение к Трудовому договору (СОУТ)";
	НоваяСтрока.Назначение = СписокНазначений;

	
			
	МассивНазначений = Новый Массив;
	Для каждого ТекСтрока Из ОписаниеПечатныхФорм Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНазначений, ТекСтрока.Назначение.ВыгрузитьЗначения(), Истина);	
	КонецЦикла;
	
	#КонецОбласти
	
#КонецЕсли  



